[{"id":"e642c9a2598507ed","type":"tab","label":"Initial Mind Map","disabled":false,"info":"# Aim\n\nAn initial mind map.\n\n","env":[]},{"id":"9cb056993602460d","type":"junction","z":"e642c9a2598507ed","x":2321.2857273817062,"y":811.476217508316,"wires":[["0b66c795f06ef06b"]]},{"id":"a17831a0eb302f20","type":"Idea","z":"e642c9a2598507ed","name":"Open Mind Maps","info":"","createdAt":"2023-07-03T08:08:48.529Z","updatedAt":"2023-07-03T11:41:28.406Z","x":1699.333023071289,"y":1357.6668541431427,"wires":[["8f5cb98d8d673b6d"]]},{"id":"8f5cb98d8d673b6d","type":"Text","z":"e642c9a2598507ed","name":"decomposing filter bubbles - DFB","info":"## alternatively: Mapping Information Bubbles\n\nDecomposing the filter bubble or more properly to call it decomposing my filter bubble what do I mean by this? It is the usage of something like Node-RED or a mind map or a concept map to build up a two-dimensional picture of all my thoughts and the connections between those thoughts. Instead of using a one-dimensional document to write all my thoughts down as they come, I'm now combining them all and linking them all together to see how my thoughts influence each other and what might the bigger picture be.\n\nI find it insightful to *see* my thoughts, where they came from and how they influence each other. It presents to me a view of where my thoughts are, what do I focus on, where is my focus is dark, where is it positive, negative, social critical, love.\n\nHow does this decompose the filter bubble in which I exist?\n\nWhat my diagram is implicitly showing is how the blogs, news, articles and everything else that I intellectually consuming, are influencing my thoughts. It shows how much influence a particular blog or news site has when I connect the dots or in this case, the nodes.\n\nIf I then look at the clear areas, those with little or no connection, I see the spots where I can extend and breakout of my filter bubble. Finding areas where something which I haven't discovered could be lurking in the background.\n\nHow does this work? For example putting in books that I've read, putting in the authors and then seeing what these authors also wrote and from there I see the loose ends in what I read and what I still need to read.\n\nVisually, working with colours I also began to see missing colours, which meant I was missing references or ideas or something else to give the overall view a sense of completion. Intellectually what this is showing me is that I've not thought about something throughly enough. Perhaps I missed a contra-view, perhaps someone else has a quote that I've missed.\n\nOn the other hand, if something is to harmonious, then I say to myself where is the dissonance? \n\nIt's linking everything together seeing flows together see how these things influence each other and then going backwards and saying okay what is the other way, what's the alternative view on that. The visualisation of that makes it easier to see these things.\n\nWriting documents I have the fear of losing ideas to forget things and not knowing them so I write them all down but then I don't see where have I repeated myself, am I going in circles where are the new things am I new, is there something else? The unfortunate downside to one-dimensionality - the lack of connection. However in the lack of connection, one-dimensionality has it's advantage, it provides focus, it provides the room to rethink and repeat ones thoughts without being constantly being pulled back into the past.\n\nWhy stop at two-dimensionality? Why indeed! I would love to be able to do the same in three-dimensional space using VR glasses. Imagining my thoughts floating in a three dimensional space where the combine to build large, more complex thoughts and ideas. Falling apart as completely different ideas and then combing with out ideas. I virtual world of pure thought.\n\nWhy Node-RED?\n\n==[Once again I'm going my own way there's plenty of mind maps out there and concept map tools but I'm using something which is not intended for that and that's Node Red and Node Red has different features which I do see which I require and these are the links to create links between these ideas and it's not just one directional it's bidirectional most mind maps I know are one unidirectional you go from one thought to the next to the next but you don't go looping back to things that influence each other and stuff like that so that's what I find Node Red is doing really well unfortunately Node Red has a few other issues it would be great my big idea would be to have something like a possibility of creating a larger text from thoughts so that you stream the text into a bigger document but that's the way I'm using it it's not possible which is unfortunate it'd be great if it was possible because then I could create larger text from my snippets of thoughts but that's probably version 2 then anyway so decomposing the filter bubble which is I think it's going to be a good idea it's going to be in next article something I think I might be writing about anyway ok]==\n\n\nI have to admit, I started with quite a bit of source material. I am an ideas hoarder - I have an almost maniacal nature of writing all my ideas down, thankfully electronically otherwise I would be drowning in paper notes - as [Pascal](https://aeon.co/essays/aphorisms-tell-philosophys-history-as-fragments-not-systems) might well have done with his 800 slips of paper:\n\n> When Pascal died in 1662, there were more than 800 slips of paper in various stages of disorder. These fragments are, in a large part, a direct consequence of his rejection of the Cartesian insistence on order and clarity.\n\nI have used [iA Writer]() to give an electronic diary from which I take my snippets and bring them into my 2D world. \n\nEmbracing repetition in form of copy and paste. In my 1D would of writing I've tried not to repeat myself or have duplication, in a 2D world I have given this hope up! I have now completely duplicated my notes into my 2D world, I change notes here and there. What is the current version? What is the best version of a thought? The answer to all those questions is simply the version I am looking at. \n\n==[.. talking about tooling and using a non-mindmap tool for a mindmap ...]==\n\nduplication prevention can be as simple as searching for a url in your mindmap. or simple terms. or you keep the duplication and remove it sometime later when you find it - there is no requirement that everything is clean and perfect. just as there is no clean and perfect mind.","createdAt":"2023-07-03T08:08:48.528Z","updatedAt":"2023-07-03T11:41:28.405Z","x":1952.333023071289,"y":1499.6668541431427,"wires":[["4490ef4ee689e030","90f45dcc8338039f","1ac5f8ee8215fc5b","109a06894e62d5f5","e69e0d2364aff7fe","11d37c33171b88ca","bb54b323ecc48a19","26ce9a38462b9e32","c9fc1f6b5ea8bade","bfb29404d9d955f8","7b40ec0a219ed0b4","9cb056993602460d","5708fd3ac88701d0"]]},{"id":"02ff01b1095dea05","type":"link in","z":"e642c9a2598507ed","name":"the decomposing filter bubble - DFB","links":["7bffaefe9999c23c","f4fae8d4bb816a67","32dcd0e5937ec794"],"x":1743.333023071289,"y":1472.6668541431427,"wires":[["8f5cb98d8d673b6d"]]},{"id":"6d5b5db9a7a7cfa4","type":"Question","z":"e642c9a2598507ed","name":"Why \"decomposing\" filter bubbles?","info":"I have this image of a bubble, a filter bubble floating in the air and it has a skin. Remove skin of a ballon and you're left with nothing but the skin.\n\nthat's not what I'm thinking of, I'm thinking of a soap bubble or something and you pop it and it falls to the ground and as it falls its skin begins to disintegrate and falls onto the **ground and starts decomposing and breaking up into its individual components** and these feed back into the fertile ground of my mind and that's why it's called decomposing a filter bubble\n\n---\n\nIronially I came upon another meaning of decomposing: using the mind map to *decompose* your information bubble into its elementary concepts and biases. **Breaking down the information bubble into small parts and making visible the interconnections between those parts.**","createdAt":"2023-07-03T08:08:48.528Z","updatedAt":"2023-07-03T11:41:28.405Z","x":1395.333023071289,"y":1579.6668541431427,"wires":[["8f5cb98d8d673b6d"]]},{"id":"dc517f78d30744b5","type":"Topic","z":"e642c9a2598507ed","name":"TODO","info":"","createdAt":"2023-07-03T08:08:48.529Z","updatedAt":"2023-07-03T11:41:28.406Z","x":1604.333023071289,"y":1751.6668541431427,"wires":[["8f5cb98d8d673b6d","bb54b323ecc48a19","93f52ec3f6fa8d90","4b2d3de31ca27ab5","7e32c901047ab99d","d9bff3799326a611"]]},{"id":"b2737acb3d752c25","type":"Inspiration","z":"e642c9a2598507ed","name":"HN & Tom Critchlow","info":"- https://tomcritchlow.com <-- this is where he has his map.\n\n- https://news.ycombinator.com/item?id=35431328 <---  original source\n\n- https://tomcritchlow.com/2023/04/03/blog-maps/\n\nHere he writes:\n\n> Hey, here’s a wacky idea. What if a bunch of us made these kinds of blog maps and then somehow wired them up together so that you could kind of walk across the map?\n\nwrote Tom an email pointing out my article https://millieons.org/w/mapping-information-bubbles - which talks exactly about his whacky idea\n\n","createdAt":"2023-07-03T08:08:48.529Z","updatedAt":"2023-07-03T11:41:28.406Z","x":1683.000015258789,"y":1319.3333580493927,"wires":[["8f5cb98d8d673b6d"]]},{"id":"36c84a30a859add8","type":"Question","z":"e642c9a2598507ed","name":"Informational bubble creation: avoiding certain media.","info":"I was thinking about this having been informed that a friend of my is going to read [marquis de sade](https://en.wikipedia.org/wiki/Marquis_de_Sade) and his sadistic inclinations. \n\nI thought to myself that I don't want to know about it because what I don't know about, I can't dream about and what I can't dream about, won't hurt me.\n\nBut in this way my informational bubble is created.\n\nSo what is better? To have a information bubble the is constituted by positive content that I don't mind having in my head or to know everything and then only struggle to keep from thinking of the evilness?\n\nA general, all purpose, all encompassing answer does not exist.","createdAt":"2023-07-03T08:08:48.530Z","updatedAt":"2023-07-03T11:41:28.406Z","x":1277.000015258789,"y":1638.3333580493927,"wires":[["8f5cb98d8d673b6d","a99695eb7b4d2466"]]},{"id":"4490ef4ee689e030","type":"Comment","z":"e642c9a2598507ed","name":"Ask HN","info":"https://news.ycombinator.com/item?id=34908188\n\n\t\nI was wondering what are some strategies to get out ones filter bubble? Are there any tools that provide insights into the boundaries of a filter bubble?\n\nI've been experimenting with a mindmap to discover what I have been focusing on, it kind of works. What have others done?\n\n","createdAt":"2023-07-03T08:08:48.528Z","updatedAt":"2023-07-03T11:41:28.405Z","x":2265.3331146240234,"y":1467.6668922901154,"wires":[["1fe887e3fadd8c7d","180a9210e5336ffa"]]},{"id":"90f45dcc8338039f","type":"Question","z":"e642c9a2598507ed","name":"Can a MindMap decompose a filter bubble?","info":"Is it even possible to pull yourself out of a hole?\n\nNormally you can't pull yourself out by the hairs but you can look into a mirror.","createdAt":"2023-07-03T08:08:48.528Z","updatedAt":"2023-07-03T11:41:28.405Z","x":2347.3331146240234,"y":1513.6668922901154,"wires":[[]]},{"id":"1ac5f8ee8215fc5b","type":"Observation","z":"e642c9a2598507ed","name":"Hoarder of Ideas/Thoughts - Fear of forgetting","info":"We all have worries about all sorts of things, some good some bad. I have left all those behind until I realised that there is one worry that I constantly carry around with me and that is the worry that I will forget something. This is subtle that it becomes nearly impossible to realise. Recently I came to understand that some thoughts, when I write them down, actually aren't yet finished. So I have developed the notion of meditating a little longer before writing down my thoughts. In fact I have come to the point where I write summaries of those thoughts that remain after a meditation session - all the thoughts that remain are either completed, or still open-ended or rememberable/memorable. hang on, that list includes all thoughts right? well no, it doesn't include those thoughts that have been forgotten! and that's the point, when I get the urge to write something down, I breath in and let the thoughts ramble just that little bit longer. Thus I am going against my worry of forgetting a thought but only in doing so can I have longer and deeper thoughts.\n\nThoughts are like chemicals in a 3D sphere drifting around. They combine to build longer chain of thoughts and sometimes they go apart again and combine into other chains of thought. They overlap and cross each other to build complex ideas. Preventing or mitigating this process too soon can be prevent the formation of longer more beautiful thoughts.","createdAt":"2023-07-03T08:08:48.528Z","updatedAt":"2023-07-03T11:41:28.405Z","x":2354.3331146240234,"y":1725.6668922901154,"wires":[["98ecf81bcdfaf6c6"]]},{"id":"109a06894e62d5f5","type":"Blog-Post","z":"e642c9a2598507ed","name":"openmindmap.org","info":"***_Building the global Mindmap, one thought at a time._***\n\n---\n\nhttps://openmindmap.org\n\nThe domain for the    \ndecomposing filter bubbles  \naka mapping information bubbles  \naka open mind maps  \naka mine.mind   \naka ...\n\n![logo](/content/openmindmap.png)\n\n---\n\nIronically Jimmy Wales started wikipedia after the realise and popularity of wikis for quick collaboration and note taking. So his idea was based on an existing technology.\n\nOpenmindmap is similiarly based on an existing technology and that is Node-RED - certainly far more complicated but the first step to a global open mind-map to explode information bubbles.\n\n---\n\n","sumPass":false,"sumPassPrio":"0","createdAt":"2023-07-03T08:08:48.528Z","updatedAt":"2023-11-20T17:46:43.578Z","x":2388.3331146240234,"y":1380.6668922901154,"wires":[["0714831429be95e8","46539392e0a7d869","cf637ddb3f98c52b","b896326e508a2d6b","9293a828e8a9882e","e86224faaad3d6e3"]]},{"id":"e69e0d2364aff7fe","type":"Blog-Post","z":"e642c9a2598507ed","name":"Mapping Information Bubbles","info":"https://millieons.org/w/mapping-information-bubbles","createdAt":"2023-07-03T08:08:48.529Z","updatedAt":"2023-07-03T11:41:28.406Z","x":2308.3331146240234,"y":1572.6668922901154,"wires":[[]]},{"id":"11d37c33171b88ca","type":"Inspiration","z":"e642c9a2598507ed","name":"BEYOND THE BUBBLE","info":"[copy of pdf](https://www.thersa.org/globalassets/pdfs/journals/issue-3-2015.pdf)\n\nfrom page 30 on:\n\n> To put it another way, the internet can enable us to flock together, as Stone hoped, but it can also leave us flying apart, leaving society more fragmented than before. It all depends on how we handle our social interactions and identity; and that is a distinctly double-edged thing.\n\n> The Georgia Tech team painstakingly crunched through 11,000 tweets discussing Tiller’s death. This showed that in direct bilateral conversations between Twitter users – those people who had replied to a specific message – there was evidence of clustering: more than two-thirds of messages sent were between people who held the same views. But in the other third of cases, people engaged with somebody who held a different view. **However, this did not seem to spread mutual respect; on the contrary, those exchanges suggested that people were becoming more, not less, polarised as time passed.** “Replies between like-minded individuals strengthen group identity whereas replies between different- minded individuals reinforce ingroup and outgroup affiliation,” Yardi and Boyd observed.\n\n> When presented with endless personal freedom to define ourselves and our community, our natural instinct is to retreat into what feels safe: namely, our social tribes.\n\n> That simple step won’t necessarily change the world. Nor will it enable Stone’s dream about humans flocking to materialise; sadly, the internet is never going to break down social barriers completely. But if we reflect on how we use the internet and how it shapes our identity, we can actively choose whether we flock together or fly apart. It just requires us to do something that no computer has mastered yet: namely, look at our social group – and think.\n\nThe article does not provide a solution just a ideal to reflect on our social tribes and how we use social media. Written in 2015 so there is a lot missing. \n\nIt's a typical academic piece where a bunch of studies are quoted and explained, aiming to prove the authors point. The author than generalises across all social media and then draws their conclusion that we live in bubbles. Doing some name-dropping along the way. It highlights something that needs highlighting but does not provide a solution other than \"have a think about it\".\n\n---\n\nhttps://thersa.org - organisation for change but it seems to be a collection of the rich echo-chambering about change.\n\n---\n\nThere is also an medium version https://medium.com/rsa-journal/beyond-the-bubble-3bf9e39eb2b5","sumPass":false,"sumPassPrio":"0","createdAt":"2023-07-03T08:08:48.529Z","updatedAt":"2025-02-01T12:55:11.774Z","x":2285.3331146240234,"y":1624.6668541431427,"wires":[["5e0c407bceaacfeb"]]},{"id":"bb54b323ecc48a19","type":"Observation","z":"e642c9a2598507ed","name":"Changes to Node-RED to make this happen","info":"## Writermap\n\n- Being able to **change the type of a node** without copying & pasting content. Use a type changer dropdown next the enabled/disabled switch.\n\nchange the type of a node using the area next to the \"enabled\" button\n\n![img](https://cdn.openmindmap.org/content/Screen%20Shot%202023-03-07%20at%2009.30.19.png)\n\n- when generating a text, **highlight all the nodes for a particular path**. so i can see which nodes and where the path was that connected those nodes. (same: for longer text documents, need to highlight all nodes that went into making a longer text document. similiar to the way that clicking on a debug (or any message in the debug view) highlights that node. Need to do this for multiple nodes at the same time.) --> DONE with the `/p/id,di,di,` link - that highlights the path taken for a document.\n\n- **editor needs a spell corrector** and ideally a synonym finder - some shortcut that finds similiar words to a highlighted one.\n\n- need to **simplify the links in/out** - no mortal will understand these links, takes a programmer to understand but on the other hand, they are not essential\n\n- **double click in the info box** of a node opens the editor view to edit that text. extending the double click on the node to open the editor view. Or have an edit icon/button somewhere in the info box.\n\n- show number of links in or out and allow for showing only checked links in the link in/out editor window\n\n![](https://cdn.openmindmap.org/content/Screen_Shot_2023-04-08_at_09.19.04.png)\n\n- **deep links to nodes** direct in a flow. must be possible since one can highlight a node from the debug list. --> DONE with next version of Node-RED.\n\n- **rotation of nodes** might be a nice feature to make mind maps look more artistic.\n\n- be able to **keep the info box open** in the properties sidebar and deploy at the same time. This makes it easy to modify text while reading it. Since the blog page can be opened, reload on edit and then edit becomes: edit, deploy, reread, edit, deploy, reread, ... instead of open sidebar with double click, close sidebar to save changes, click deploy button, double click on node to open sidebar, ...","sumPass":false,"sumPassPrio":"0","createdAt":"2023-07-03T08:08:48.529Z","updatedAt":"2025-02-01T13:05:20.652Z","x":2344.3331146240234,"y":1676.6668922901154,"wires":[["46539392e0a7d869","f67b7e9848d5e2c3","467fdad293c63aa8","91544b53fd696bf3","8227e4e6eab246d2"]]},{"id":"26ce9a38462b9e32","type":"Thought","z":"e642c9a2598507ed","name":"Getting out of the comfort zone","info":"Decomposing the filter bubble or mapping the information bubble are similiar to exiting the comfort zone that we all find ourselves in.\n","sumPass":false,"sumPassPrio":"0","createdAt":"2023-07-03T08:08:48.529Z","updatedAt":"2025-02-01T12:48:58.649Z","x":2402.3331146240234,"y":1313.6668922901154,"wires":[[]]},{"id":"c9fc1f6b5ea8bade","type":"Thought","z":"e642c9a2598507ed","name":"Filter bubbles make us more sensitive to\\n detecting and avoiding confrontational opinions and ideas.","info":"As we are more and more protected from controversail ideas and opinions by the filter bubbles, we lose the ability to accept contra thoughts. We become more sensitive to being faced with ideas that go against what we believe.\n\nWe have lost the acceptance of multi views on many topics. We have become too safe in our bubbles.\n\nWhich is fine if it wasn't for entropy that will eat us up.\n\nFilter bubbles are an entrophy-free space that does not reflect the state of the universe.","createdAt":"2023-07-03T08:08:48.528Z","updatedAt":"2023-07-03T11:41:28.405Z","x":2395.3331146240234,"y":1237.6668922901154,"wires":[[]]},{"id":"bfb29404d9d955f8","type":"Observation","z":"e642c9a2598507ed","name":"random buttons on search engines","info":"go here and presse the random button https://search.marginalia.nu/\n\nbut those random buttons might well know your search preferences and give you corresponding results.","createdAt":"2023-07-03T08:08:48.529Z","updatedAt":"2023-07-03T11:41:28.406Z","x":2293.000015258789,"y":1176.3333580493927,"wires":[["8217b17bce00e376","62952ac34537c2fd","60fd57af2a0d0cd7"]]},{"id":"7b40ec0a219ed0b4","type":"Idea","z":"e642c9a2598507ed","name":"Image to model mindmap on","info":"The idea would be to insert an image (ideally svg) into the background of the workspace and then use that to design the mindmap in form of that image.\n\nFor example\n\n![imge](https://cdn.openmindmap.org/content/open_mind.svg)\n\nThe code is fairly simply: \n\n```\n$.get( \"/content/open_mind.svg\", function(data) { const serializer = new XMLSerializer(); var svgdata = serializer.serializeToString(data); $($($('svg')[0]).find('> g > g > g')[2]).append(svgdata) })\n```\n\nThat puts the image below the nodes and connections and above the grid.\n","sumPass":false,"sumPassPrio":"0","createdAt":"2023-07-03T08:08:48.530Z","updatedAt":"2025-02-01T13:09:35.392Z","x":2301.4998931884766,"y":1849.5833580493927,"wires":[["446c046789088600"]]},{"id":"5708fd3ac88701d0","type":"Idea","z":"e642c9a2598507ed","name":"Brainstorm tool als open mind map","info":"The usage of openmindmap.org as a brainstorm tool whereby ideas are entered as they come up in a meeting.\n\nAfter that one can organise these using the visual nature of OMM.org.\n\nFinally a single pathway is defined and then a single markdown document can be generated as a summary of the brainstorming meeting.\n\n","sumPass":false,"sumPassPrio":0,"sumPassNodeId":"","createdAt":"2024-11-13T16:00:32.994Z","updatedAt":"2024-11-13T16:02:53.933Z","x":2491.000015258789,"y":923.3333580493927,"wires":[[]]},{"id":"93f52ec3f6fa8d90","type":"Thought","z":"e642c9a2598507ed","name":"","info":"Humans are extremely selfish if their believe themselves to be in danger of losing their possessions or status. But also when they believe themselves to be independent of the society that provided for them.\n","sumPass":false,"sumPassPrio":"0","createdAt":"2023-07-03T08:08:48.529Z","updatedAt":"2024-09-18T07:13:05.222Z","x":2326.333511352539,"y":2299.3331735134125,"wires":[[]]},{"id":"4b2d3de31ca27ab5","type":"Thought","z":"e642c9a2598507ed","name":"","info":"Aristelo has upload his brain into the Internet, as has Karl marx and many more. Their lives and thoughts continue to be discussed, scrutinised and explored. They live on.\n","sumPass":false,"sumPassPrio":"0","createdAt":"2023-07-03T08:08:48.529Z","updatedAt":"2024-09-18T07:13:19.499Z","x":2312.8889923095703,"y":2411.222139120102,"wires":[[]]},{"id":"7e32c901047ab99d","type":"link out","z":"e642c9a2598507ed","name":"TODO","mode":"link","links":["8617c9cdc2a38007"],"x":2111.5554962158203,"y":2136.555744409561,"wires":[]},{"id":"d9bff3799326a611","type":"Thought","z":"e642c9a2598507ed","name":"Electricity will be the oil crisises of the 21st century","info":"Just as the oil crisis shocked the western world, so will an electricity crisis.\n\nIt might not happen as bad as all that since electricity is global, thanks to the sun. So this crisis might well be completely different but it will come.\n\nWhat will happen? As society moves to an electricity based economy - electric cars, electric phones, electric pumps to transfer warmth in the winter, electric everything, electricity takes centerpoint of society, much as oil did for much of the 20th century.\n\nWe believe as a society that we have learnt from the mistakes of the past and move to electricity to replace oil. Unfortunately we are moving to a far more fragile society since electricity isn't something that comes out of the ground and can be used. Electricity is an end product of a chain of activity. Either via conversion from oil, or conversion from sunlight or conversion of wind.\n\nElectricity loses much in transport so that it becomes a very local product, depdended on the current conditions being faced on a local level. Norway produces a lot of electricity via dams and water energy. That is a local product that is depended on the water supply.\n\nThose that burn coal to produce electricity are depended on that coal, etc.\n\nSo the crisis won't be the Saudias not selling us oil, rather it will be that local conditions do not provide enough electricity and the our electrical-based economy will come to a halt. This local problem expands as the neighbours around one are asked to provide electricity. But as transport of electricity is a major problem still, this will cause more problems. Local areas will be left to fend for themselves.\n\nA further issue with electricity is that it can be influenced by sunflares. These can easily destroy the electrical infrastructure that we have created.\n\nElectricity-based economy is more fragile than an oil based one. We can only hope that it is a cleaner economy than the one that got us here. Our new economy must have some benefit!","createdAt":"2023-07-03T08:08:48.530Z","updatedAt":"2023-07-03T11:41:28.406Z","x":2251.2225494384766,"y":2488.5557701587677,"wires":[["c6625243b2d3811c"]]},{"id":"a99695eb7b4d2466","type":"Poesie","z":"e642c9a2598507ed","name":"Not knowing Doesn't Hurt","info":"What I don't know, I can't think about  \nWhat I can't think about, I can't dream about  \nWhat I can't dream about, can't give me nightmares.\n\nThe idea that certain things I avoid reading about or listening to (mostly negative and horrible things). \n\nThis creates my filter bubble but a positive feedback filter bubble.\n\n","sumPass":false,"sumPassPrio":"0","createdAt":"2023-07-03T08:08:48.530Z","updatedAt":"2024-10-27T10:00:26.435Z","x":1816.9998931884766,"y":2522.3333580493927,"wires":[[]]},{"id":"1fe887e3fadd8c7d","type":"Inspiration","z":"e642c9a2598507ed","name":"improve the news","info":"https://www.improvethenews.org/faq\n\n> This is a free news aggregator and news analysis site developed by a group of researchers at MIT and elsewhere to improve your access to trustworthy news. Many website algorithms push you (for ad revenue) into a filter bubble by reinforcing the narratives you impulse-click on. By understanding other people’s arguments, you understand why they do what they do – and have a better chance of persuading them.","createdAt":"2023-07-03T08:08:48.528Z","updatedAt":"2023-07-03T11:41:28.405Z","x":2483.3331146240234,"y":1431.6668922901154,"wires":[[]]},{"id":"180a9210e5336ffa","type":"Definition","z":"e642c9a2598507ed","name":"False balance","info":"https://en.m.wikipedia.org/wiki/False_balance\n\n> False balance is a bias which usually stems from an attempt to avoid bias and gives unsupported or dubious positions an illusion of respectability. It creates a public perception that some issues are scientifically contentious, though in reality they may not be, therefore creating doubt about the scientific state of research, and can be exploited by interest groups such as corporations like the fossil fuel industry or the tobacco industry, or ideologically motivated activists such as vaccination opponents or creationists.","createdAt":"2023-07-03T08:08:48.528Z","updatedAt":"2023-07-03T11:41:28.405Z","x":2446.3331146240234,"y":1472.6668922901154,"wires":[[]]},{"id":"e9ff1a63643eda4c","type":"link in","z":"e642c9a2598507ed","name":"hoarder of ideas","links":["6c6b8c7c7d4a7cb9"],"x":2086.3331146240234,"y":1725.6668922901154,"wires":[["1ac5f8ee8215fc5b"]]},{"id":"5f979a28c6a3b136","type":"Metaphor","z":"e642c9a2598507ed","name":"Open Steet Map v. Open Mind Map","info":"Taking the analogy with street maps a step further. We have global street maps, [Open Street Map](https://www.openstreetmap.org) is a societally built and maintained map of the world. We have a societally built and maintained one-dimensional source of knowledge - Wikipedia. Would it not be a benefit to all to have an open collection of mind maps? Allowing us all to escape our own bubbles?\n","sumPass":false,"sumPassPrio":"0","createdAt":"2023-07-03T08:08:48.529Z","updatedAt":"2024-10-01T12:57:10.258Z","x":1984.333023071289,"y":1336.6668541431427,"wires":[["109a06894e62d5f5","b75995db7579e9af","1b875ba60882545b"]]},{"id":"0714831429be95e8","type":"Observation","z":"e642c9a2598507ed","name":"Concentrate on the openmindmap","info":"Given the overfilled market of writer tools, it would be better to follow the open mind-map idea rather than the writermap - i.e. a tool for writers.","createdAt":"2023-07-03T08:08:48.529Z","updatedAt":"2023-07-03T11:41:28.406Z","x":2864.333023071289,"y":1342.6668541431427,"wires":[["87c3981a59120cf9"]]},{"id":"46539392e0a7d869","type":"Observation","z":"e642c9a2598507ed","name":"How to use Node-RED as Mind-map - shortcuts","info":"To make this happens, need to make it clear how to use the shortcuts that I use and how I make the whole thing work well for me:\n\n- using search to navigate around my map (**cmd-F**) also using the 'type:XXX' search filter\n\n- using **cmd-uparrow** and cmd-downarrow to move nodes to align them along straight joins\n\n- how i organise my stuff with **links-in and links-out** and give some guidelines for naming those links\n\n- **cmd-D** for deploying, i.e. saving the map. which could perhaps be done between with an automatic process such penpot uses.\n\n- using search to find links in/out in the sidebar for creating a link. **Naming convention** for links in/out (i.e. the same as the node they represent)\n\n- **cmd-0/-/+** to zero and reset zoom, great for quickly getting an overview of an entire mind map\n\n- **shift-click** to highlight all nodes in an immediate cluster of connected nodes.\n\n- **shift-enter** to close and save the editor sidebar. It then becomes a matter of shift-enter, cmd-d to update content.\n\n- **alt-a** for alignment to make things look good:\n\n```\n⌥-a l - left align\n⌥-a c - center align\n⌥-a r - right align\n\n⌥-a t - top align\n⌥-a m - middle align\n⌥-a b - bottom align\n```","sumPass":false,"sumPassPrio":"0","createdAt":"2023-07-03T08:08:48.529Z","updatedAt":"2023-07-06T07:09:53.116Z","x":2890.3331146240234,"y":1502.6668922901154,"wires":[["87c3981a59120cf9","ae6d4384473b619b"]]},{"id":"cf637ddb3f98c52b","type":"Blog-Post","z":"e642c9a2598507ed","name":"beta.openmindmap.org","info":"https://beta.openmindmap.org/\n\nHave to get a node Red instance up and running as a read only blog page - as demonstration. Could use the mapping information bubbles as a starting point for pushing to heroku.\n\n","sumPass":false,"sumPassPrio":"0","createdAt":"2023-07-03T08:08:48.529Z","updatedAt":"2024-11-13T16:06:48.021Z","x":2839.333511352539,"y":1299.1111900806427,"wires":[["5a865dc0ba3d524b"]]},{"id":"b896326e508a2d6b","type":"link out","z":"e642c9a2598507ed","name":"openmindmap.org","mode":"link","links":["0716d5454301e3e7","d9191f12ef15b32d"],"x":2931.000015258789,"y":1432.3333580493927,"wires":[]},{"id":"9293a828e8a9882e","type":"Text","z":"e642c9a2598507ed","name":"OpenMindMap as psychological tool","info":"So, similar to the gender slider, the Open Mind Map app can also be a psychological tool, in that people get a series of notes, political, something like, I don't know, some topics or something, some more specific things than just thoughts or dreams or ideas, and they have to combine them in various ways, depending on how they feel. \n\nThen having combined them and linked them and created new flows and taken multiple flows and whatever, the psychologist would then use a sink and seeker nodes to find all possible combinations and paths through those flows, and thereby analyzing the patients and their thoughts and why this should be the case. \n\nOf course, the purpose of that would be to have a conversation and not to be like Freud perhaps being told that you have sexual desires for your mother or something like that, it's supposed to be more of an icebreaker kind of conversation starter and something that a psychologist and their patients could start a conversation about.\n\nIt's nothing deeper, it's nothing like the [Ink spots](https://en.wikipedia.org/wiki/Rorschach_test), seeing what you can see in an Inkspots.\n\n","sumPass":false,"sumPassPrio":0,"sumPassNodeId":"","createdAt":"2024-11-03T11:48:45.357Z","updatedAt":"2024-11-03T11:52:49.541Z","x":3725.000015258789,"y":1570.3333580493927,"wires":[["ac95cb582dcbf5b2"]]},{"id":"e86224faaad3d6e3","type":"Idea","z":"e642c9a2598507ed","name":"Make it like a brain","info":"Make it like a brain an create connections between nodes\n\nSo just as neurons get enforced as their relationship becomes more obvious, so should the mindmap be improved and strengthed.\n\nWhat this would require is a weighting on connections - this does not exist in node red and the question is how would this be implemented?\n\nReinforce those pathways that traversed by viewers which in turn causes a echo chamber or filter bubble!","sumPass":false,"sumPassPrio":0,"sumPassNodeId":"","createdAt":"2024-11-13T16:00:44.355Z","updatedAt":"2025-01-14T12:30:04.416Z","x":3044.000015258789,"y":1387.3333580493927,"wires":[[]]},{"id":"8c84535d0300a750","type":"link in","z":"e642c9a2598507ed","name":"social tribes","links":["2a5830327eec5ae3"],"x":2084.333023071289,"y":1624.6668541431427,"wires":[["11d37c33171b88ca"]]},{"id":"5e0c407bceaacfeb","type":"Quote","z":"e642c9a2598507ed","name":"","info":"When presented with endless personal freedom to define ourselves and our community, our natural instinct is to retreat into what feels safe: namely, our social tribes.","createdAt":"2023-07-03T08:08:48.529Z","updatedAt":"2023-07-03T11:41:28.406Z","x":3165.333023071289,"y":1668.6668541431427,"wires":[[]]},{"id":"f67b7e9848d5e2c3","type":"Observation","z":"e642c9a2598507ed","name":"Use Zoom level to create a third dimension","info":"Each zoom level has its own collection of nodes that can be connected to nodes below it.\n\nBasically as you zoom out, you can add nodes but that are \"normal\" size. These can be connected to all visible nodes, be they the same size as the node just added or a smaller node (a node that is on a zoom level below the current level).\n\nAll nodes on higher zoom levels (or lower depending on your perspective) would not be visible - in fact you might only have maximum two levels of zoom visible at all times.\n\nBut there would be connections (just as the link in/out have) links indicating that there are more connections into other zoom levels.\n\n(there seem to be 10 zoom levels from default zoom level, so probably 5 levels in either direction would be fine, i.e. every second zoom step generates a new layer of nodes)","createdAt":"2023-07-03T08:08:48.529Z","updatedAt":"2023-07-03T11:41:28.406Z","x":2881.000015258789,"y":1550.3333580493927,"wires":[[]]},{"id":"467fdad293c63aa8","type":"Inspiration","z":"e642c9a2598507ed","name":"Other online Node-RED instances","info":"https://playground.mindconnect.rocks\n\nSiemens product placement for their mindconnect. Done as a read-only instance that can't be modified.\n\nhttps://flowforge.com/node-red/\n\nSign-up and get free trial version of Node-RED.","createdAt":"2023-07-03T08:08:48.529Z","updatedAt":"2023-07-03T11:41:28.406Z","x":2857.000015258789,"y":1739.3333580493927,"wires":[[]]},{"id":"91544b53fd696bf3","type":"Observation","z":"e642c9a2598507ed","name":"","info":"Signal bot that adds notes to mind map automatically","createdAt":"2023-07-03T08:08:48.529Z","updatedAt":"2023-07-03T11:41:28.406Z","x":2910.000015258789,"y":1591.3333580493927,"wires":[[]]},{"id":"8227e4e6eab246d2","type":"Question","z":"e642c9a2598507ed","name":"How to improve the mobile experience","info":"Need to remove the palette and sidebar automagically on mobile.","createdAt":"2023-07-03T08:08:48.529Z","updatedAt":"2023-07-03T11:41:28.406Z","x":2867.111343383789,"y":1773.7779381275177,"wires":[["b6ebf229befcac86"]]},{"id":"4a4cdfe6046a66cc","type":"link in","z":"e642c9a2598507ed","name":"Getting out of the comfort zone","links":["6c6b8c7c7d4a7cb9","89998e89dd3d04db"],"x":2189.3331146240234,"y":1313.6668922901154,"wires":[["26ce9a38462b9e32"]]},{"id":"6febf63cb8317dec","type":"Definition","z":"e642c9a2598507ed","name":"entropy","info":"entropy is the increasse in randomness, the order goes against entropy.\n\nexample is puring hot water into a tub of cold water, the entropy increases as the hot water spreads throughout the tub making the water have the same temperature throughout the tub.\n\nhttps://en.wikipedia.org/wiki/Entropy","createdAt":"2023-07-03T08:08:48.528Z","updatedAt":"2023-07-03T11:41:28.405Z","x":2052.3331146240234,"y":1237.6668922901154,"wires":[["c9fc1f6b5ea8bade"]]},{"id":"8217b17bce00e376","type":"Inspiration","z":"e642c9a2598507ed","name":"4columns","info":"https://4columns.org/","createdAt":"2023-07-03T08:08:48.529Z","updatedAt":"2023-07-03T11:41:28.406Z","x":2557.000015258789,"y":1081.3333580493927,"wires":[[]]},{"id":"62952ac34537c2fd","type":"Inspiration","z":"e642c9a2598507ed","name":"xxiivv","info":"http://wiki.xxiivv.com/site/home.html\n\n","createdAt":"2023-07-03T08:08:48.529Z","updatedAt":"2023-07-03T11:41:28.406Z","x":2567.000015258789,"y":1128.8333580493927,"wires":[[]]},{"id":"60fd57af2a0d0cd7","type":"Inspiration","z":"e642c9a2598507ed","name":"wikiscroll","info":"https://wikiscroll.blankenship.io/","createdAt":"2023-07-03T08:08:48.529Z","updatedAt":"2023-07-03T11:41:28.406Z","x":2557.000015258789,"y":1176.3333580493927,"wires":[[]]},{"id":"446c046789088600","type":"Thought","z":"e642c9a2598507ed","name":"DrawSVG Node","info":"In the introspection collection:\n\nhttps://flows.nodered.org/node/@gregoriusrippenstein/node-red-contrib-introspection\n\n","createdAt":"2023-07-03T08:08:48.530Z","updatedAt":"2023-07-03T11:41:28.406Z","x":2559.9998931884766,"y":1812.5833580493927,"wires":[["a1009f9fac9e8ab2"]]},{"id":"6bbe84ddc11cd5c0","type":"Text","z":"e642c9a2598507ed","name":"mining the mind","info":"## Mining my mind\n\nI imagine a coal face a pickaxe in one hand and a lantern in the other. I begin to chip away, burrowing my way into the coal face. Chip for chip I get further into the mountain.\n\nI imagine the shafts as I pickaxe my way through my mind, thrust by thrust, word by word my texts are created. Each shaft is slowly perfected and supported by beams of grammar and supports of elegancy.\n\nSo it is, as I chip away at my stories. With my pen I chip away the words in my mind, word for word, extending the shaft. Stabilising the shaft with beams of grammar, supports of learning. \n\nAs the shafts get longer and more intertwined, the more complex they get. Sometimes they collapse and a new shaft needs to be dug. Always following a vein of inspiration, wherever that may take me.\n\nSometimes shafts are given up as having been mined, not being of the perfect structure required for the text. No amount of reshaping would bring them back into alignment with the text. They are abandoned, to perhaps be rediscovered by another mine of my mind.\n\nI burrow deeper and deeper into my unconscious, being amazed by the intricate structure I discover. Sometimes fossils of bygone stories appear. They now seem to make sense in this new mine.\n\nEach text becomes its own mine into my mind. Occasionally minefields appear that undermine my mining of mine mind, regardless I progress further. \n\nSometimes I end up coming up for air. Light blending my eyes and I begin to reflect. Reflect on what it is that I have discovered in my mind, reflect on what I have constructed and reflect upon the unconscious that brought me here.\n\nPlans of the mine of mine mind show me the complexity that I have woven together to make a story that appeals, when only, to me but that is my mine of my mind. \n\nExtracting the gold dust of my mind to weave the intricate stories of my mind. \n\n\n\n---\n\nThis imaginary is quite different to the usual reason for a mine: extraction. In this case the text is being shaped and designed by the shafts of the mind. Or the text is shaped with the mine while the words are mined from the mind.\n\n","createdAt":"2023-07-03T08:08:48.529Z","updatedAt":"2023-07-03T11:41:28.406Z","x":1991.000015258789,"y":810.8333580493927,"wires":[["9cb056993602460d","adf6ce0ddc71b7bd"]]},{"id":"0b66c795f06ef06b","type":"Text","z":"e642c9a2598507ed","name":"Maze of the Mind","info":"My mind map here, here in Node-RED is a maze of my mind. A mind that is full with thoughts, ideas, questions and all the rest of it.\n\nI navigate through this maze to find the Minotaur lurking in the darkest corners of my mind.","createdAt":"2023-07-03T08:08:48.529Z","updatedAt":"2023-07-03T11:41:28.406Z","x":3261.000015258789,"y":814.8333580493927,"wires":[["87c3981a59120cf9","0298d2a969177c02","338ba9628495b069","01d7fdf13f2f4b31"]]},{"id":"c6625243b2d3811c","type":"Idea","z":"e642c9a2598507ed","name":"inter planetary communication","info":"Sun flares have been happening with lights in the night sky. Just had the thought that they may be increasing since earth has a bad case of humans and the only way to get rid of them is to cause the electricity to fail. The last saviour for the planet. Well not for the planet but for the diversity of life on this planet. Humans destroying so much that other species are suffering. Perhaps there is a inter planetary communication method and the sun is aiding the earth.","sumPass":false,"sumPassPrio":0,"sumPassNodeId":"","createdAt":"2024-06-03T09:02:43.158Z","updatedAt":"2024-06-03T09:03:02.101Z","x":2638.0001373291016,"y":2586.6668541431427,"wires":[[]]},{"id":"0d798e2469ddeec4","type":"Aphorism","z":"e642c9a2598507ed","name":"productive boredom is creativity","createdAt":"2023-07-03T08:08:48.528Z","updatedAt":"2023-07-03T11:41:28.405Z","x":1101.3330688476562,"y":617.33349609375,"wires":[[]]},{"id":"98ecf81bcdfaf6c6","type":"Aphorism","z":"e642c9a2598507ed","name":"One idea is best","info":"one good idea is the best,  \ntwo ok ideas bring decision,  \nthree ideas are the cause for pause.\n\n---\n\nzero ideas are peace  \none idea is great  \ntwo make for a decision  \nthree are a cause for pause\n\n---\n\nzero ideas are peace  \none idea is great  \ntwo require decision  \nthree are a cause for pause","createdAt":"2023-07-03T08:08:48.528Z","updatedAt":"2023-07-03T11:41:28.405Z","x":2967.3331146240234,"y":1853.6668922901154,"wires":[["c9aba1bf506a3872","1c0dee55ed70699e"]]},{"id":"ad195112735e9527","type":"Text","z":"e642c9a2598507ed","name":"fidgetious","info":"Yesterday and today had the feeling of being over distracted from todos that all wanted doing. I get this when too many ideas begin to pop up in my head and I can't get rid of them. **Each idea is a like a little child screaming for the attention of its parent.** A birds nest of beaks all at the same time screaming for food and attention. My usual switching between tasks becomes a hectic, distracted, confused approach. Beginning with one todo, then get distracted by another todo, switching to that todo only to be distracted by the original task until I'm totally confused as to what I should be doing. Perhaps the best thing is to write about this. An alternative that I find works quite well is to grab a *good* book and lie on the sofa for an hour. That calms the soul and steadies the mind. But mind you, if it's not a good book, I'll be up and about within five minutes. That's why I've always have to have a good book to hand. Another approach is to write down ideas to forget them or rather have them out of my mind. Have a note book handy to write those ideas down, short quick sentences or just a few chosen words. But that sometimes doesn't work. In some situations the todos and ideas need doing and I would like to do each one but, for the life of me, I don't know in which order I should approach them. In some cases I think about the order - quickest first or the least difficult or the task-upon-which-all-tasks-depend first - but at times when the mind is fidgetious (from fidgety + continuously), it feels as if the mind doesn't have the necessary calmness to find an ordering. The mind becomes a hyper-spiral of hyper-activity resulting in deadlock and gridlock. In such state, it is also impossible to perform any task to any level of competence - that is to say, picking a task to do leads to being distracted so I can't concentrate on that task, so I end up performing it badly. What's the point of doing that? That's way taking a break on the sofa can really help to calm the mind and focus the spirit.\n","sumPass":false,"sumPassPrio":"0","createdAt":"2023-07-03T08:08:48.528Z","updatedAt":"2023-07-14T14:06:33.534Z","x":3676.333038330078,"y":1917.0001168251038,"wires":[["4df0f6b2918a473d"]]},{"id":"b75995db7579e9af","type":"Idea","z":"e642c9a2598507ed","name":"Associate new content with old content","info":"when you create new content in the global open mind map, that it automatically gets associated with other people's thoughts, so that you can actually give in, you drag some text in and then it's automatically via maybe KI, AI, associated with other thoughts which are similar, so that you can sort of reflect upon the fact that the thought you just had wasn't that unique and that new.","sumPass":false,"sumPassPrio":0,"sumPassNodeId":"","createdAt":"2024-11-05T10:32:41.917Z","updatedAt":"2024-11-05T10:32:56.719Z","x":2515.000015258789,"y":986.3333580493927,"wires":[["b4070248db44553d"]]},{"id":"1b875ba60882545b","type":"Idea","z":"e642c9a2598507ed","name":"Word trainer","info":"Have two columns of words in two different languages and the user has to visual associate one word with its correct translation.","sumPass":false,"sumPassPrio":0,"sumPassNodeId":"","createdAt":"2024-11-10T16:15:24.754Z","updatedAt":"2024-11-10T16:16:09.492Z","x":2359.000015258789,"y":1087.3333580493927,"wires":[[]]},{"id":"87c3981a59120cf9","type":"Idea","z":"e642c9a2598507ed","name":"Writermap","info":"Call it writermap and publish it as a tool for writers to organise their thoughts online.\n\nGiven the fixed and pre-defined nodes to organise their stuff.\n\n","createdAt":"2023-07-03T08:08:48.529Z","updatedAt":"2023-07-03T11:41:28.406Z","x":3451.333023071289,"y":1333.6668541431427,"wires":[["6a695c55c11a39f7","c822ce5b4d2e9901","70dde306f46497b2"]]},{"id":"ae6d4384473b619b","type":"Observation","z":"e642c9a2598507ed","name":"Navigation","info":"I've noticed that navigation through the mindmap is done mainly by knowing what is contained in the mindmap.\n\nThis makes it harder to explore a mindmap that one has created oneself.\n\nOn the other hand, it would make it a lot of fun to go from ones own mindmap to another since one would begin by navigating ones own mindmap.","createdAt":"2023-07-03T08:08:48.529Z","updatedAt":"2023-07-03T11:41:28.406Z","x":3304.000015258789,"y":1591.3333580493927,"wires":[[]]},{"id":"5a865dc0ba3d524b","type":"Blog-Post","z":"e642c9a2598507ed","name":"demo mindmap","info":"https://demo.openmindmap.org <-- shutdown rather no longer accessible\n\nbetter example: https://blog.openmindmap.org/mindmapviewer.html","sumPass":false,"sumPassPrio":"0","createdAt":"2023-07-03T08:08:48.529Z","updatedAt":"2025-02-01T12:35:34.710Z","x":3164.000015258789,"y":1298.3333580493927,"wires":[["76cc6d60e03e27e4"]]},{"id":"176516dc63c261e4","type":"Bookmark","z":"e642c9a2598507ed","name":"Rorschach test - Wikipedia","info":"https://en.wikipedia.org/wiki/Rorschach_test","sumPass":false,"sumPassPrio":0,"sumPassNodeId":"","createdAt":"2024-11-03T11:51:31.564Z","updatedAt":"2024-11-03T11:51:31.564Z","x":3395.000015258789,"y":1501.3333580493927,"wires":[["9293a828e8a9882e"]]},{"id":"82f8dbd9de0d3cc9","type":"link in","z":"e642c9a2598507ed","name":"OpenMindMap as psychological tool","links":["fd60e1768090f300"],"x":3494.000015258789,"y":1444.3333580493927,"wires":[["9293a828e8a9882e"]]},{"id":"ac95cb582dcbf5b2","type":"Idea","z":"e642c9a2598507ed","name":"Word Association","info":"Two columns of words that the patient should freely associate.\n\nThen pathways of associations are analysed.\n","sumPass":false,"sumPassPrio":"0","createdAt":"2023-07-03T08:08:48.524Z","updatedAt":"2024-11-10T16:13:37.910Z","x":4033.000015258789,"y":1503.3333580493927,"wires":[[]]},{"id":"b6ebf229befcac86","type":"Thought","z":"e642c9a2598507ed","name":"IsMobile Node","info":"https://github.com/gorenje/node-red-contrib-introspection/blob/7b7ac19bb7e7c879854e73df3f02381e868e3f24/nodes/25-ismobile.html#L28-L33\n\nThe isMobile node removes the sidebars (left and right) if on a mobile device.","createdAt":"2023-07-03T08:08:48.530Z","updatedAt":"2023-07-03T11:41:28.406Z","x":3325.889663696289,"y":1755.5556480884552,"wires":[[]]},{"id":"184805e3011856b9","type":"Bookmark","z":"e642c9a2598507ed","name":"What Is Entropy? A Measure of Just How Little We Really Know. | Quanta Magazine","info":"https://www.quantamagazine.org/what-is-entropy-a-measure-of-just-how-little-we-really-know-20241213/\n\n","sumPass":false,"sumPassPrio":0,"sumPassNodeId":"","createdAt":"2024-12-14T13:00:24.998Z","updatedAt":"2024-12-14T13:00:24.998Z","x":1595.000015258789,"y":1261.3333580493927,"wires":[["6febf63cb8317dec"]]},{"id":"a1009f9fac9e8ab2","type":"Thought","z":"e642c9a2598507ed","name":"Svg2png","info":"https://en.wikipedia.org/wiki/Librsvg\n\n```\nrsvg-convert --format=png --output=diagram.png diagram.svg\n```\n","sumPass":false,"sumPassPrio":0,"sumPassNodeId":"","createdAt":"2023-08-29T10:08:17.246Z","updatedAt":"2023-08-29T10:08:39.334Z","x":2564.9998931884766,"y":1867.3333580493927,"wires":[[]]},{"id":"50cbe53c3cb15d26","type":"Text","z":"e642c9a2598507ed","name":"About Writing","info":"Thoughts on writing, what to write and where to write. \n\nReflections on the right and wrong of writing. \n\nHint: there are none.\n","sumPass":false,"sumPassPrio":"0","createdAt":"2023-07-03T08:08:48.529Z","updatedAt":"2023-07-12T08:15:25.456Z","x":1639.333267211914,"y":841.666671037674,"wires":[["95577053956e7dec","6bbe84ddc11cd5c0","3a0a0067ee956896","eab6d1f2f2817cc8","4374635822248c82","dce98b70accca825","e528a226f99a7a0d","ae5d9ad74f63ab39"]]},{"id":"0298d2a969177c02","type":"Aphorism","z":"e642c9a2598507ed","name":"Seeing the path out of the labyrinith of the mind","info":"","sumPass":false,"sumPassPrio":0,"sumPassNodeId":"","createdAt":"2024-10-29T14:39:05.793Z","updatedAt":"2024-10-29T14:39:27.804Z","x":3631.000015258789,"y":750.3333580493927,"wires":[[]]},{"id":"338ba9628495b069","type":"Sink","z":"e642c9a2598507ed","name":"Maze Of The Mind","x":3625.000015258789,"y":811.3333580493927,"wires":[]},{"id":"01d7fdf13f2f4b31","type":"Audio","z":"e642c9a2598507ed","name":"Rethinking Mindmaps in the age of Artifical Intelligence","info":"<div class=\"audio-container\">\n<audio controls preload=none>\n<source src=\"https://cdn.openmindmap.org/content/1737284096368_Rethinkingmindmaps.m4a\" type=\"audio/x-m4a\" />\n</audio>\n<p>Download <a href=\"https://cdn.openmindmap.org/content/1737284096368_Rethinkingmindmaps.m4a\" download=\"Rethinkingmindmaps.m4a\">file</a></p>\n</div>\n\nSo, rethinking mind maps in the age of AI. \n\nSo creating a mind map nowadays in the age of AI, AI being a representation of our mind in form of a computer, in form of silicon, that representation is how we believe the mind works like. And mind maps are apparently a map of our minds. \n\nNow, it's the classical mind maps go, they have square boxes that go out with lines going out and out and out, and there's no looping back and there's no typing. So these boxes don't have really much type. And there's no, there's no interaction with a mind map, it's created, and then you look at it and go, well, and all these things are old school mind maps. \n\nSo let's try and recreate those mind maps, let's make them interactive. Since this is a very important thing, since we want a interaction between our minds and ourselves because our minds don't stand still. It's not like that. We can create a snapshot of our minds. But since we've created that snapshot, it's actually antiquated and pointless. So we need to keep on maintaining our mind maps and maintain them in a simple and easy way to do that, to update them as our thoughts gradually grow and then expand. \n\nAnd also our minds are interactive, I interact with my mind, I think, and I interact and I have thoughts and I build concepts and I build ideas. And this is the same way that a mind map should be, it should be interactive and computational. So based on my mind map, I want to create new ideas, new thoughts. So I want to be able to go through my mind and building up new ideas. So it has to be interactive. \n\nAnd a mind map should also provide types. I have an idea, I have a thought, I have an observation, I have a question. These are different types of thoughts I maintain in my mind map. So I need to be able to type mind maps. Mind maps should be working like science. I have certain inputs, from those inputs I create certain thoughts, and from those thoughts, from multiple thoughts, I create conclusions and theories. \n\nOr other way around, I have a conclusion and a theory, and I would recreate the thoughts and the ideas and the experiments to prove that theory. So that's another way a mind map should be able to be used and worked. And this all adds up to a type of mind map where one has a bi-directional linking between nodes, one can alter the types of nodes, one can interact with the types of nodes, one interacts with the nodes of the mind map. One has media, one has a mind contains songs, contains videos, contains images, contains situations. So a mind map must also contain videos and audio and pictures, because that's what our minds also have. \n\nAnd should be able to interlink minds. My mind is interlinked with the minds of my friends. So we share parts of our minds together. So that's the way mind maps should also be interlinkable. And we have also different types, including also people. So you need to have nodes that represent people in your mind map. You have to represent all these concepts that we have in the world within a mind map. And that can be interlinked, all types, everything can be interlinked, even though it might seem silly to be interlinking a video with an observation, but that's the way our mind works. \n\nAnd I have an observation, I have a thought, I have an experiment, and I have a video to that because that's something particularly happened, something, a scenario happened, and that caused me to have that thought. That has to be interlinked.\n\nSo that's the future of mind maps, make intelligent mind maps this way. And if these mind maps grow big enough, then we can probably create intelligence out of that, you can create pathways of thoughts. And so in a certain sense, you move up the chain of intelligence. And instead of predicting words, AI will predict pathways through mind maps. Okay, so you tokenize the prompts, and you create pathways, and then you simulate these pathways within various mind maps, and then you predict the next node that would come up on this mind map. And so then you're actually handling concepts and not words, and nodes and not words. So that will make it an artificial intelligence, far more intelligence than just predicting words without any particular context. \n\nAnd since you're also dividing, you create pathways within mind maps, you can easily say, okay, this is the pathway that actually created this answer or this node. So you can also have, you have context, and you have referential ability, you reference, you take a reference of what pathway you're using. And you have [nachvollziehbarkeit](https://www.dict.cc/?s=Nachvollziehbarkeit) [Ed: traceability, replicability, transparency]. So basically, you can understand what is happening and why it happened.\n","sumPass":false,"sumPassPrio":0,"sumPassNodeId":"","createdAt":"2025-01-19T10:54:56.835Z","updatedAt":"2025-02-01T13:18:50.600Z","x":3639.000015258789,"y":585.3333580493927,"wires":[["6aeadef44c9dc4d6"]]},{"id":"b1d282de7590fb6b","type":"Observation","z":"e642c9a2598507ed","name":"Losing Empathy in becoming adults","info":"IN becoming adults, the world changes for us from a very empathetic, loving world to a taking, wanting, greedy, cruel world. \n\nPerhaps we were lost in this world. Lost perhaps because our emotional needs weren't being fulfilled. Lost because we always needed our mother for the empathy we had as children.\n\nPerhaps in having children we believe that giving empathy is the same as recieving empathy or alternatively it is the belief that our children will love us and give us that missing empathy that we search for since our childhood.","createdAt":"2023-07-03T08:08:48.530Z","updatedAt":"2023-07-03T11:41:28.406Z","x":1291.6666259765625,"y":2046.6669921875,"wires":[[]]},{"id":"db218a48c6f23dc1","type":"Text","z":"e642c9a2598507ed","name":"profound boredom","info":"\"profound boredom\"\n\nprofound boredom is the boredom one suffers when solitude and loneliness are approach, at home alone, with nothing to do and no one to talk to. according to this [article](https://www.bath.ac.uk/announcements/social-media-may-prevent-users-from-reaping-creative-rewards-of-profound-boredom-new-research/) and the corresponding [hacker news](https://news.ycombinator.com/item?id=34138188) discussion, this can lead to creative phases where new ideas can finally take form.\n\nThe original paper differentiates between superficial boredom - the kind experienced at a bus stop waiting for a bus and the profound boredom whereby your are alone at home with nothing to do.\n\nFrom a [comment](https://news.ycombinator.com/item?id=34141244) there could also be a form of *attentive* boredom whereby you are stuck in a traffic jam, completely boredom but you have to remain attentive to prevent accidents. That kind of boredom could be the worst form since you can't do anything that takes your attention but on the other hand, your attention is tired to a very boring activity.\n\nI put in a [comment](https://news.ycombinator.com/item?id=34142148) about *What exactly is the difference between idling, daydreaming, meditating, musing or sitting on sofa with eyes shut and profound boredom?* The deeper meaning here is that there are many ways to activate creativity or give the brain a pause, something that our brains need just as our bodies: *Aren't all these activities doing the same thing, giving the brain pause to calm down, to refocus. Perhaps our brains require idle times as our bodies need pause after exercise.* as the comments continues.\n\nThere are some who seem to [worry that they kids should not be bored](https://news.ycombinator.com/item?id=34141173). If true, it is strange to believe that ensuring that your children are never bored would prepare them for life. Working life is mostly about being bored and if you can't handle it or recognise it, then you will have a fairly frustrating life.\n\nThe HN discussion really hit home for me. I spend a lot of time being \"bored\" but not because I don't have anything to do nor not because I don't have any ideas, but because my mind needs a rest. A rest from the constant input of the sensory world. I'm spending more and more time meditating, which for me is a form of controlled boredom. In fact meditating is the challenge to accept and experience boredom for long periods of time. So in a sense, I force boredom onto myself because sometimes I get the nervous feeling that everything is too much and I am about to explode.\n\nI have come to realise that meditation, for me, is about shutting off the sensors. Shut eyes, quiet room or constant, relaxing music, no taste, no touching and no smell. The entire situation of classic meditation is deconstruction of sensoria input. Only by preventing the mind from being activated by input can the mind come to rest and settle down for a moment. And it only has to be for a moment. Boredom is for me a state of involuntary meditation then. One can only reach profound boredom by having no sensory inputs.\n\nIt would also be interesting to know whether boredom has become a luxury item. Can people afford to be profoundly bored, not superficial bored in a world where time is money and everyone is running around trying to make a buck or two.\n\nIt was ironic that I found the article and the HN discussion in a moment of boredom, it's discovery made my boredom strangely productive. In addition to that, it made be creative and write this text.\n\n","sumPass":false,"sumPassPrio":"0","createdAt":"2023-07-03T08:08:48.528Z","updatedAt":"2024-10-04T07:48:34.819Z","x":798.3330688476562,"y":268.33351135253906,"wires":[["f694c384add2a5a6","8b921c44d8e33757","779bcbf55acda042","0d798e2469ddeec4","45f1b6f98dcc7eb8","fe5bd5dab769130b"]]},{"id":"729f69dced4f4399","type":"Topic","z":"e642c9a2598507ed","name":"ADHD","info":"Attention Deficit Syndrom\n\nAttention Deficit Hyperactivity Disorder\n\nWierd to be calling it a disorder but such is life.","sumPass":false,"sumPassPrio":0,"sumPassNodeId":"","createdAt":"2023-07-14T08:22:59.096Z","updatedAt":"2023-07-14T08:23:55.002Z","x":3091.000030517578,"y":1917.0001168251038,"wires":[["ad195112735e9527","57f68379f333eba2"]]},{"id":"c9aba1bf506a3872","type":"Poesie","z":"e642c9a2598507ed","name":"Ideas","info":"Zero ideas are bliss  \nOne idea is virtuous  \nTwo requires decision  \nThree is a cause for pause.","createdAt":"2023-07-03T08:08:48.529Z","updatedAt":"2023-07-03T11:41:28.406Z","x":3195.333023071289,"y":1794.6668541431427,"wires":[[]]},{"id":"1c0dee55ed70699e","type":"Disadvantage","z":"e642c9a2598507ed","name":"Node popup","info":"On mobile built a popup attached to the node to display the info text.\n\nPopup works ok on desktop where scroll works but clicking on a link doesn't. On mobile scroll does not work and neither does clicking on links.\n\nOn mobile the popup is a complete fail even thought it does look good and shows the info details.","createdAt":"2023-07-03T08:08:48.530Z","updatedAt":"2023-07-03T11:41:28.406Z","x":3238.000015258789,"y":1852.3333580493927,"wires":[[]]},{"id":"4df0f6b2918a473d","type":"Observation","z":"e642c9a2598507ed","name":"Have a note book handy","info":"This idea of having a note book handy to write down ideas and thoughts. \n\nSoft-skin A5 moleskin notebooks are best.\n\n","sumPass":false,"sumPassPrio":0,"sumPassNodeId":"","createdAt":"2023-07-14T11:13:39.820Z","updatedAt":"2025-02-01T13:42:21.063Z","x":4291.000030517578,"y":2036.3333103656769,"wires":[[]]},{"id":"b4070248db44553d","type":"Bookmark","z":"e642c9a2598507ed","name":"Cross-Browser Local LLM Inference Using WebAssembly — Picovoice","info":"https://picovoice.ai/blog/cross-browser-local-llm-inference-using-webassembly/\n\n","sumPass":false,"sumPassPrio":0,"sumPassNodeId":"","createdAt":"2024-11-16T11:22:06.081Z","updatedAt":"2024-11-16T11:23:01.155Z","x":3113.000015258789,"y":946.3333580493927,"wires":[["3ef9fdb12073d4ee","14aa00e10a389e05"]]},{"id":"2c3854fae7bdc2b5","type":"Inspiration","z":"e642c9a2598507ed","name":"HN on Lunette","info":"https://news.ycombinator.com/item?id=35307656","createdAt":"2023-07-03T08:08:48.529Z","updatedAt":"2023-07-03T11:41:28.406Z","x":3097.333023071289,"y":1257.6668541431427,"wires":[["87c3981a59120cf9"]]},{"id":"37a86a2371934e68","type":"Inspiration","z":"e642c9a2598507ed","name":"Superus on HN","info":"https://news.ycombinator.com/item?id=35709088","createdAt":"2023-07-03T08:08:48.529Z","updatedAt":"2023-07-03T11:41:28.406Z","x":3176.000015258789,"y":1066.3333580493927,"wires":[["87c3981a59120cf9"]]},{"id":"6a695c55c11a39f7","type":"Comment","z":"e642c9a2598507ed","name":"HN","info":"https://news.ycombinator.com/item?id=35311978\n\nI find Scapple[1] more interesting since it comes close to what I'm playing around with. I've started using Node-RED[2] as a mind-map for my ideas and thoughts. I've created custom nodes to provide a categorization for ideas, thoughts, observations, inspiration etc. As I a see fit I link nodes together. The end result is a chaotic mind-map which I call a writermap since the entire mind-map is executable. Between any two points in the mind-map I can create a document with all the paths that link those two points. The document is just a concatenation of all the nodes visited along the way.\n\nTaking this a step further, I thought about creating a global mind-map whereby everyone contributes their mind-maps into interconnected open mind-map. I had this idea because I realised that I had mapped my information bubble in creating my mind-map. But how do I get out of my information bubble? Hence the idea of an open mind-map[2] to navigate through other peoples mind-maps out of my information bubble.\n\n[1]=https://www.literatureandlatte.com/scapple/overview\n\n[2]=https://nodered.org/\n\n[3]=https://millieons.org/w/mapping-information-bubbles ","createdAt":"2023-07-03T08:08:48.529Z","updatedAt":"2023-07-03T11:41:28.406Z","x":3692.333023071289,"y":1334.6668541431427,"wires":[[]]},{"id":"c822ce5b4d2e9901","type":"Idea","z":"e642c9a2598507ed","name":"Blogroller","info":"As to be found at blog.openmindmap.org - a blogging software based on the writermap nodes.\n\nThe worlds first blog based on a mind-map diagram with live updates.\n\n**Personally Philosophically Reflecting on Node-RED**\n\nPerhaps I should quickly point what my motivation is in doing this. \n\nI began using Node-RED as a programming environment for doing *stuff* and soon realised that the two-dimensionality of Node-RED provided one more dimension than my editor. I began also seeing the flexibility Node-RED provided and began more and more to think about the representation of a node.\n\nNode-RED node makes the assumption that nodes are bits of computer code that get executed and passed along connections. I saw colourful boxes that were joined to one another! I saw these boxes as representing anything, not just code to be executed.\n\nI began using nodes as content, content of my writings. I realised that the one-dimensionality of my editor was limiting my ideas and writing. What was at the top of a document was never seen again. What was written days ago, was forgotten and repeated in long documents.\n\nI needed to organise my writing in a better form. That is when I began viewing Node-RED as a mind-map tool, but a mind-map tool with executable nodes. So I began wondering what my mind-map nodes should be doing when they get executed.\n\nAnd that's when I came up with the idea of have my mind-maps generate texts for me.\n\nIronically this is proving to be difficult since I am moving for two-dimensions to one-dimension and that implies that I lose a dimension. Gaining a dimension means more freedom, reducing means culling that freedom.\n\nI am beginning to think that a blog, i.e., a one-deminsional web representation, is not the perfect means to transport content in mind-map form.\n\nAnd that is still part of the experiment: how to find a better way to provide motivation for creating your own mind-map and uploading to openmindmap.org (one day) to create a global mind map.\n\n","createdAt":"2023-07-03T08:08:48.530Z","updatedAt":"2023-07-03T11:41:28.406Z","x":3731.000015258789,"y":1284.3333580493927,"wires":[[]]},{"id":"70dde306f46497b2","type":"Idea","z":"e642c9a2598507ed","name":"SubPass option on nodes / Summary Node","info":"A options to specify that a writermap node is a summary node collecting all the details of other nodes together and passing this into a into a node.\n\n\n![img](https://cdn.openmindmap.org/content/1687853303094_Screen_Shot_2023-06-27_at_10.08.03.png)\n\nIn this case the `SubPassNode` would have a checkbox to activate the summarisation (this would be shown in the label with an ∑ sum symbol). The checkbox would activate a dropdown to select the output node to which the summary shoud be passed (its passed to all connected nodes but this node isn't part of the summary).\n\nThe `Thought` node would get a writermap array with an entry for the subpass node that contained it's sub-nodes, so the hash would have an extra array containing the details of the subnodes conencted to the `SubPassNode`.\n\nThe result returned by the SubPassNode would be passed to all its connected output nodes however it is assumed that the subnodes aren't connected on - i.e. they really only provide a point in a list or arguments collection or whatever.\n\nAny writernode can be made to a subpass node, this isn't a special extra node. Hence the checkbox and the dropdown list for selecting the output node to which the data is sent.\n\n(SubPass or SumPass is from summaries and pass on or sub-nodes passed on)","sumPass":false,"sumPassPrio":"0","createdAt":"2023-07-03T08:08:48.530Z","updatedAt":"2025-02-01T12:53:17.285Z","x":3785.000015258789,"y":1394.3333580493927,"wires":[[]]},{"id":"76cc6d60e03e27e4","type":"Inspiration","z":"e642c9a2598507ed","name":"OpenMindMap : beta.openmindmap.org","info":"https://beta.openmindmap.org/","sumPass":false,"sumPassPrio":0,"sumPassNodeId":"","createdAt":"2024-10-29T14:42:11.565Z","updatedAt":"2024-10-29T14:42:11.565Z","x":3587.000015258789,"y":1194.3333580493927,"wires":[[]]},{"id":"3929f555d03b39af","type":"Bookmark","z":"e642c9a2598507ed","name":"What Is Entropy? A Measure of Just How Little We Know | Hacker News","info":"https://news.ycombinator.com/item?id=42415386\n\n","sumPass":false,"sumPassPrio":0,"sumPassNodeId":"","createdAt":"2024-12-14T13:13:27.020Z","updatedAt":"2024-12-14T13:13:50.721Z","x":734.3332214355469,"y":1259.6667022705078,"wires":[["184805e3011856b9"]],"icon":"@gorenje/node-red-mindmap/hn.svg"},{"id":"8e5a586506e22eeb","type":"link in","z":"e642c9a2598507ed","name":"about writing","links":["83624fdf94021cfa"],"x":1342.3332061767578,"y":741.666671037674,"wires":[["50cbe53c3cb15d26"]]},{"id":"95577053956e7dec","type":"Observation","z":"e642c9a2598507ed","name":"less is more","info":"## less is more\n\nMost important when describing a scene, you don't need much in the way of description. This is something I notice when I was reading [Vonnegut](https://en.wikipedia.org/wiki/Kurt_Vonnegut) - he has very lovely pictures in his books but his descriptions can be limited so that the imagine of the reader does the rest. The rule of thumb is that common things that must people have a understanding of or have experience need minimal description: \"a house was standing on the hill, its two front windows where ablaze with the light from within\" from the reader can make their own picture. Alternative would be \"a white-coloured house having two front windows stood on the hill. the windows where framed in wooden frames made of the old mahogany that the trees around the house gave up willingly. the the windows were ablaze with the lights from within\". The latter might just too much for the average reader unless it is of relevance that there are mahogany trees growing around the house. I think that Vonnegut does this well, for example in [sirens of titan](https://en.wikipedia.org/wiki/The_Sirens_of_Titan) he describes the house of Rumfoord on titan as being a copy of the taj malhal. Done. there isn't any further description because it is not relevant for the plot and secondly reader is assumed to know what the taj malhal looks like. Instead Vonnegut describes the lakes and rivers that are located on titan, i.e. the things the reader has no imagery of. And that's important: to provide readers with imagery and description that they have not encountered.\n\n","createdAt":"2023-07-03T08:08:48.529Z","updatedAt":"2023-07-03T11:41:28.406Z","x":1984.333267211914,"y":762.666671037674,"wires":[[]]},{"id":"3a0a0067ee956896","type":"Thought","z":"e642c9a2598507ed","name":"Authors worlds are small rooms","info":"An authors world is in their head, they don't need much physical space, they just need their minds to expand their space.\n\nHaving a place, a safe space where one can write, not much else is required. The world is only there to be observed and to test ideas that the author has in their minds.\n\n","createdAt":"2023-07-03T08:08:48.529Z","updatedAt":"2023-07-03T11:41:28.406Z","x":2003.000015258789,"y":966.3333580493927,"wires":[[]]},{"id":"eab6d1f2f2817cc8","type":"Observation","z":"e642c9a2598507ed","name":"writing is composing","info":"Write like a dance, good writers structure their ideas to become a dance of words and sounds.\n\nSo a good writer is composing good music for the reader to dance to. ","sumPass":false,"sumPassPrio":"0","createdAt":"2023-07-03T08:08:48.529Z","updatedAt":"2023-07-12T08:15:19.413Z","x":1995.000015258789,"y":859.3333580493927,"wires":[[]]},{"id":"4374635822248c82","type":"Aphorism","z":"e642c9a2598507ed","name":"Write what needs to be written not what has to be written.","info":"Sometimes I sit down and think I need to write on story/article X but then have no stimulus to actually write on that. Instead there might be something else that I want to write on.\n\nThat's when it helps to have multiple documents *open* and easily switched to. This is what I am doing with Node-RED *writermap* and iA writer both being open and with multiple tabs accessible.\n\nWrite what *needs* to be written not what *has to be* written.\n\nBe ready to write what you feel needs to be written and not what you have to write","sumPass":false,"sumPassPrio":"0","createdAt":"2023-07-03T08:08:48.529Z","updatedAt":"2024-08-19T09:24:55.997Z","x":2015.000015258789,"y":1011.3333580493927,"wires":[[]]},{"id":"dce98b70accca825","type":"Observation","z":"e642c9a2598507ed","name":"Prompt Engineering","info":"What used to be called writing is now called prompt engineering!\n\n> Although straightforward, mastering prompt engineering is challenging. Not everyone has the aptitude for it.\n\n> Instead of obsessing over writing flawless prompts in one go, get comfortable with A/B testing. Prompt engineering requires much trial and error. Relentlessly edit formulas until you find the right tone, phrasing, and terms to convey instructions.\n\n> The Public Needs Pre-Made Prompts\n\nhttps://www.makeuseof.com/career-in-prompt-engineering/\n\n\n\n","sumPass":false,"sumPassPrio":"0","createdAt":"2023-07-03T08:08:48.529Z","updatedAt":"2023-08-26T07:43:18.475Z","x":1901.000015258789,"y":620.3333580493927,"wires":[["f51f24a5eb4b9f1a","b294d4532c346392"]]},{"id":"e528a226f99a7a0d","type":"Observation","z":"e642c9a2598507ed","name":"Language must be banned or regulated because it can generate this sentence.","info":"This is a reference to governments now regulating AI because they are collectively scared of it. \n\nThere was a [discussion]( https://news.ycombinator.com/item?id=35960125) of it on HN where the tenor was that big government should stay out of it and big tech will certainly do the best for all of humankind.\n\nSlowing there should be a realisation that you can't regulate everything, else the consequence would be to ban language and communication.\n\nAs long as communication exists, bad things will happen.\n\nAlso the sentence contains something we must not let happen: banning communication using language, hence the sentence must be unsaid and banned.","sumPass":false,"sumPassPrio":"0","createdAt":"2023-07-03T08:08:48.530Z","updatedAt":"2025-02-01T12:30:13.314Z","x":2023.000015258789,"y":1057.3333580493927,"wires":[[]]},{"id":"ae5d9ad74f63ab39","type":"Observation","z":"e642c9a2598507ed","name":"writing is similar to programming","info":"You end up refactoring and renaming stuff, you throw away things that don't work, you comment out stuff in the hope of using it later (hint: never happens).\n\nwriting and programming are actually the same thing except the author usese the programming language [english](https://github.com/theletterf/english-lang).\n\nUpon reflection: I only believe this because I come from programming and went to writing. An author who never programmed would not understand this. It would be interesting to talk to an auther that went to programming and to see whether they would see it like this too.\n\n---\n\nTo the english language above, the hacker news discussion: https://news.ycombinator.com/item?id=36689564","sumPass":false,"sumPassPrio":0,"sumPassNodeId":"","createdAt":"2023-07-12T08:15:32.776Z","updatedAt":"2024-10-29T14:36:38.660Z","x":2007.000015258789,"y":916.3333580493927,"wires":[[]]},{"id":"6aeadef44c9dc4d6","type":"Text","z":"e642c9a2598507ed","name":"Notes","info":"Rethinking Mindmaps in the age of Artificial Intelligences\n\n- Making mindmaps flexible \n\t- linking nodes bidirectionally, not unidirectional\n\t- altering the type of nodes, thoughts become observations\n\n\n- Making mindmaps interactive\n\t- adding media that can be viewed and interact-able \n\t- making mindmaps alterable\n\n- Making mindmaps interlinkable\n\t- creating mindmaps that interlink amongst themselves\n\n- Making mindmaps have context\n\t- nodes that define types - contact, thought, idea, question etc\n\n","sumPass":false,"sumPassPrio":0,"sumPassNodeId":"","createdAt":"2025-01-22T10:57:30.479Z","updatedAt":"2025-01-22T10:58:24.335Z","x":3966.000015258789,"y":513.3333580493927,"wires":[[]]},{"id":"9dc3920b1f36073a","type":"Blog-Post","z":"e642c9a2598507ed","name":"Empathy","info":"https://millieons.org/w/empathy\n\nIt was raining on my head but it wasn't the rain from clouds, it was the rain of a shower head cleansing me. It is in these moments of silent reflection that thoughts come to me. Most probably these thoughts come from somewhere deep in my subconscious. These are the moments when the conscious is blackened by the motoric that takes over during tasks that are completely automatic. Feelings of warmth, relaxation and safety reinforce this state.\n\nToday was a day were I was reflecting on life and dealing with family affairs. I was particularly emotional triggered in a melancholy feeling of oneness with the universe. It was at the moment reflecting on empathy and the ability to be empathic.\n\nMy mother was a particularly empathic person, caring for many people in her life, not least her four children. I was wondering why we as children weren't particularly empathic people. In fact being quite the opposite, very focussed on ourselves and our problems. Far too busy with thoughts of our own dire straits to be bother with other people and their problems.\n\nI wondered why this would be the case. Having a very loving and caring mother who rarely, if ever, desired to be the middle point of any event or situation. I realised that to be an empathic person you need to have experienced the joy of caring for others. To put yourself at the disposal of someone in need. To push your worries and problems to the outside and listen to other peoples troubles. All these activities have to be actively experienced to understand and comprehend the joys of empathy.\n\nEmpathy is a not a science that you can learn from a textbook, there aren't any hard and fast rules on how to be empathic to other people. And it was this realisation that made me think about us children.\n\nHaving experienced empathy on a daily basis did not make us empathic. Instead we assumed that empathy would always be there for us. There would always be someone looking after us and we won't need to provide support to others.\n\nBecoming adults the world changed from a very empathetic, loving world to a taking, wanting, greedy, cruel world. And perhaps we were lost in this world. Lost perhaps because our emotional needs weren't being fulfilled. Lost because we always needed our mother for the empathy we had as children.\n\nAnd now with the passing away of our mother, we are completely lost. Our only source of empathy has evaporated.\n\nThe well is dry and we search for a new well.\n\n","sumPass":false,"sumPassPrio":"0","createdAt":"2023-07-03T08:08:48.528Z","updatedAt":"2024-04-18T14:19:03.962Z","x":995.888671875,"y":2075.55615234375,"wires":[["b1d282de7590fb6b"]]},{"id":"e7d976b3ed6fec3b","type":"Text","z":"e642c9a2598507ed","name":"Empathy","info":"Empathy is a manifestation of altruism, or is it the other way around? Both take the centre point of ones life - oneself - and moves this centre point to the external world around oneself. Focusing on other people, other problems and other joys. Being able to be happy for someone else, accepting and enjoying someones victory over oneself. Sharing that joy is true altruism. Being big enough to jump over ones own shadow. The leopard that does change its spots.\n\nEmpathy is an active action of altruism. It is the letting-someone-else-win action for the sack of the greater good. It is the action of helping someone to the point of detrimental consequences for oneself. The highest form is throwing yourself in front of the proverbial bus to save someone else. You die, they survive.\n\nWhat form does empathy take? There is the **emotional empathy**, probably the most common form. It's the feeling and understanding of emotions that another person has. It's the conversational sharing that happens amongst good friends. It's the listening to other peoples pains and joys without interruption or discourse, simply listening and understanding.\n\nThere is the financial empathy of giving someone less well-of than yourself financial support. Be it that beggar on the street or a friend who has lost all their money on the horses and cannot pay their rent. **Financial empathy** is probably the easiest form of empathy to measure, but the hardest form to execute. I loaned you this much money and no I don't want it back .... or do I? That is the execution, overcoming that doubt and realisation that some of your own financial freedom has been sacrificed to support someone else. And financial freedom is freedom in a capitalistic society that is the West.\n\n**Physical empathy** is giving someone a hug when they need it. Providing that human closeness that we all need. The only thing that needs to be conquered is ones own physical repulsion of the other person. When was that last time you gave that beggar a hug? Physical empathy can do a lot of good, more good than other forms of empathy however it is probably the shortest lived form of empathy. It's the shot of cocaine that disappears about as fast it's gone up the nose.\n\n**Intellectual empathy** is the ability to accept someones view on a particular matter that is for oneself very clear and obvious but complete opposed to the view the other. To accept that and not criticise their standpoint is a form of intellectual empathy. It is the acceptance that the world is flat, potential causing a cognitive dissonance in ones own mind. It is the acceptance that nothing will convince the other of their intellectual failings which is the highest art. It is the renunciation of all forms of debate to argue the point that makes one grow and love more. In that this growing one wins the personal joy of empathy.\n\nAnd it is the personal joy of helping someone that makes empathy an addictive feeling. It is the purity of this feeling that makes the difference between empathy that is altruist and empathy that is egoist. The empathy that arises from have a bad conscience and thinking that helping someone will clear that conscience that is the empathy based on the ego.\n\nGiving someone money because one is having an affair with that persons partner is a form of empathy that is based on the submission to a bad conscience rather than the pure joy of giving. Unless of course one has told that person one is having an affair with that persons partner!\n\nGiving based on taking isn't empathy.\n\nTaking here takes many forms. Emotional taking, physical taking, and so on, are indirecting taking that might motivate direct giving. Is it bad to give in response to taking? Well no, not per se. It's just not showing empathy and therefore it should be sold as being empathy.\n\n_Giving based on taking is a transaction._\n\nA quid pro quo so to say. So what could the motivation behind empathy be? Why do some people literally help others to their own detriment? Probably the answer to this is similar to finding the one unifying theory of physics, wake me when we've found it. In fact there are probably just as many answers as there are people being empathetic.\n\nOne form that I've discovered is a very personal form that I inherited from my mother. It's the empathy based on the joy of making random strangers happy. Making something beautiful and the placing it somewhere, not waiting for its discovery nor the joy that it (hopefully) brings when discovered. It is the thought of the joy makes me happy and is my personal motivation to continue.\n\nMy mother imparted this onto me in a very subtle form. It took many years for me to understand and act on this form of empathy but it happened quite naturally. It is the empathy that happens when oneself is under enormous stress and burden. It is going against the ‌automatism of feeling bad and lonely in bad times, it is taking the reverse position and doing something positive which makes oneself feel positive. It fact is taking the negative energy and combining it all to get a positiveness - two negatives make a positive. This also works for emotional energies.\n","sumPass":false,"sumPassPrio":"0","createdAt":"2023-07-03T08:08:48.528Z","updatedAt":"2023-11-29T15:58:14.082Z","x":773.3331298828125,"y":2160.889404296875,"wires":[["6c60c63014e8ed46","e63bfc828bdfda2d","13aedc65c06bb4c9","9dc3920b1f36073a"]]},{"id":"8a955e8590b37f7e","type":"Inspiration","z":"e642c9a2598507ed","name":"Social media may prevent users from reaping\\n creative rewards of profound boredom - new\\n research","info":"https://www.bath.ac.uk/announcements/social-media-may-prevent-users-from-reaping-creative-rewards-of-profound-boredom-new-research/","createdAt":"2023-07-03T08:08:48.528Z","updatedAt":"2023-07-03T11:41:28.405Z","x":451.33306884765625,"y":268.33351135253906,"wires":[["db218a48c6f23dc1","0ae093ee14beaff5"]]},{"id":"cb699cf43875e281","type":"Inspiration","z":"e642c9a2598507ed","name":"HN","info":"https://news.ycombinator.com/item?id=34138188","createdAt":"2023-07-03T08:08:48.528Z","updatedAt":"2023-07-03T11:41:28.405Z","x":576.3330688476562,"y":372.33351135253906,"wires":[["db218a48c6f23dc1"]]},{"id":"f694c384add2a5a6","type":"Comment","z":"e642c9a2598507ed","name":"HN","info":"https://news.ycombinator.com/item?id=34142148\n\nWhat exactly is the difference between idling, daydreaming, meditating, musing or sitting on sofa with eyes shut and profound boredom?\n\nAren't all these activities doing the same thing, giving the brain pause to calm down, to refocus. Perhaps our brains require idle times as our bodies need pause after exercise. ","sumPass":false,"sumPassPrio":"0","createdAt":"2023-07-03T08:08:48.528Z","updatedAt":"2024-10-04T07:48:49.377Z","x":1033.3330383300781,"y":268.33351135253906,"wires":[[]]},{"id":"8b921c44d8e33757","type":"Aphorism","z":"e642c9a2598507ed","name":"meditation, for me, is about shutting off the senses. ","info":"","sumPass":false,"sumPassPrio":"0","createdAt":"2023-07-03T08:08:48.528Z","updatedAt":"2024-11-05T10:39:43.648Z","x":1171.3330383300781,"y":306.3335494995117,"wires":[["6c8fd353c859ebb7","8263d83576f0e6c5"]]},{"id":"779bcbf55acda042","type":"Aphorism","z":"e642c9a2598507ed","name":"It was ironic that I found the article and the HN\\n discussion in a moment of boredom, it's\\n discovery made my boredom strangely\\n productive.","createdAt":"2023-07-03T08:08:48.528Z","updatedAt":"2023-07-03T11:41:28.405Z","x":1161.3330383300781,"y":391.3335494995117,"wires":[[]]},{"id":"45f1b6f98dcc7eb8","type":"Inspiration","z":"e642c9a2598507ed","name":"How to wander","info":"https://psyche.co/guides/how-to-wander-in-a-world-that-values-purpose\n\nArticle describes the importance of wandering and randomly wandering. \n\nSomewhat what Werner Herzog also said about walking.","sumPass":false,"sumPassPrio":"0","createdAt":"2023-07-03T08:08:48.529Z","updatedAt":"2024-09-17T08:32:47.622Z","x":1061.9999389648438,"y":552.0000152587891,"wires":[[]],"icon":"@gorenje/node-red-mindmap/aeon.svg"},{"id":"fe5bd5dab769130b","type":"Inspiration","z":"e642c9a2598507ed","name":"UseNothing","info":"\nhttps://usenothing.com\n\nhttps://www.youtube.com/watch?app=desktop&v=BGL97pH7juk\n\nhttps://www.youtube.com/watch?v=8An2SxNFvmU\n\nhttps://news.ycombinator.com/item?id=41551084\n\n","sumPass":false,"sumPassPrio":0,"sumPassNodeId":"","createdAt":"2024-09-17T08:33:15.748Z","updatedAt":"2024-09-17T08:37:26.339Z","x":1051.9999389648438,"y":495.00001525878906,"wires":[[]]},{"id":"57f68379f333eba2","type":"Observation","z":"e642c9a2598507ed","name":"Normality","info":"~~Sufferers~~ of ADHD - Sufferers isn't the right word, it's not a \"disease\" or \"disorder\" it's normality!\n\nAt least that's my view, I've lived like this for many a long year and I never thought I was \"sick\" or had a \"disease\". I believed that everyone was like this, i.e., ones mind constantly going from one thought to the other - non-stop.\n\nWhen I was younger I was very fidgety but that I am no longer. Instead my mind is fidgety and that's probably why many people would never suspect that I have ADHD.\n\nBut I do suffer from attention deficit and I have to really focus to keep my interest for conversations that bore me. Its very difficult sometimes to remain polite.\n\nBut of course, what is \"normal\" in a world where everyone is suffering and also suffering from something external.\n\nIn the end, it's a matter of coping with the hand that was dealt.\n ","sumPass":false,"sumPassPrio":0,"sumPassNodeId":"","createdAt":"2023-07-14T10:51:55.242Z","updatedAt":"2023-07-14T11:07:49.112Z","x":3236,"y":2017.333251953125,"wires":[["eb531a522c0c2794"]]},{"id":"ad4f4f9b3f04cef7","type":"Observation","z":"e642c9a2598507ed","name":"Programming and Computers gave me ways to cope","info":"Mentally Destacking comes from programming and without knowing how a stack works, I would never have found a way to deal with my thoughts as they happen in my head.\n\nThey come one after the other and I have to manage them somehow. So the imaginery of a stack and pushing thoughts and popping thoughts makes it easier for me to deal with my head.","sumPass":false,"sumPassPrio":0,"sumPassNodeId":"","createdAt":"2023-07-14T11:09:23.490Z","updatedAt":"2023-07-14T11:11:08.775Z","x":3826,"y":2036.3333103656769,"wires":[["69b878556b3f571a","4df0f6b2918a473d","121d2f95635032c9","84f8c69a6a727468"]]},{"id":"3ef9fdb12073d4ee","type":"Video","z":"e642c9a2598507ed","name":"text_classification.mp4","info":"<div class=\"video-container\">\n<video width=\"640\" height=\"360\" controls=\"controls\" preload=\"none\" poster=\"https://cdn.openmindmap.org/content/1732102058795_text_classification.mp4.png\">\n<source src=\"https://cdn.openmindmap.org/content/1732102058795_text_classification.mp4\" type=\"video/mp4\">\nYour browser doesn't support HTML5 video.\n</video>\n<p>Download <a href=\"https://cdn.openmindmap.org/content/1732102058795_text_classification.mp4\" download=\"text_classification.mp4\">file</a></p>\n</div>","sumPass":false,"sumPassPrio":0,"sumPassNodeId":"","createdAt":"2024-11-20T11:27:52.277Z","updatedAt":"2025-02-01T13:19:25.570Z","x":4340.000015258789,"y":823.3333580493927,"wires":[[]]},{"id":"14aa00e10a389e05","type":"Image","z":"e642c9a2598507ed","name":"text_classification9.gif","info":"![img](https://cdn.openmindmap.org/content/1732102026854_text_classification9.gif)\n","sumPass":false,"sumPassPrio":0,"sumPassNodeId":"","createdAt":"2024-11-20T11:27:07.042Z","updatedAt":"2025-02-01T13:19:01.321Z","x":3723.000015258789,"y":941.3333580493927,"wires":[[]]},{"id":"3292f67b0f366caa","type":"Observation","z":"e642c9a2598507ed","name":"Similiar tool: Lunette","info":"https://lunette.app/\n\nAlso a writer tool but one based on word processing and post-it notes within the word processing experience.","createdAt":"2023-07-03T08:08:48.529Z","updatedAt":"2023-07-03T11:41:28.406Z","x":2824.3330154418945,"y":1257.6668541431427,"wires":[["2c3854fae7bdc2b5"]]},{"id":"70e2bd4cd464a822","type":"Observation","z":"e642c9a2598507ed","name":"Similiar tool: obsidian","info":"https://obsidian.md/\n\nVery much the idea of writermap, it has a graph view, a document view and it's all done in markdown. In addition to that, it's free and stores everything locally on your machine.","createdAt":"2023-07-03T08:08:48.529Z","updatedAt":"2023-07-03T11:41:28.406Z","x":2824.3330154418945,"y":1210.0001440048218,"wires":[["2c3854fae7bdc2b5","e5ef92332193956c"]]},{"id":"301b540db046f34d","type":"Observation","z":"e642c9a2598507ed","name":"Similiar tool: scapple","info":"https://www.literatureandlatte.com/scapple/overview\n\nThis does proper grahps for outlining a story, basically the mindmap for a book.\n\nhttps://www.literatureandlatte.com/scrivener/overview\n\nscrivener is the word processing side of story writing.\n\nHow the two are combined, I didn't investigate.","sumPass":false,"sumPassPrio":"0","createdAt":"2023-07-03T08:08:48.529Z","updatedAt":"2024-01-15T08:49:20.543Z","x":2824.3330154418945,"y":1114.66672372818,"wires":[["2c3854fae7bdc2b5"]]},{"id":"26116e777bd68dba","type":"Observation","z":"e642c9a2598507ed","name":"Similiar tools: typora.io","info":"https://typora.io/\n\nAlthough this is just iA Writer, not graphing technology.","createdAt":"2023-07-03T08:08:48.529Z","updatedAt":"2023-07-03T11:41:28.406Z","x":2824.3330154418945,"y":1162.3334338665009,"wires":[["2c3854fae7bdc2b5"]]},{"id":"e9cd8acea8b6a953","type":"Observation","z":"e642c9a2598507ed","name":"Similar tool: Superus","info":"https://www.superusapp.com/hn2map/\n\nhttps://www.superusapp.com\n\nhttps://www.superusapp.com/chatgpt2d/\n\n","sumPass":false,"sumPassPrio":"0","createdAt":"2023-07-03T08:08:48.529Z","updatedAt":"2024-01-15T08:48:50.179Z","x":2824.3330154418945,"y":1067.000013589859,"wires":[["37a86a2371934e68"]]},{"id":"cc21117215588622","type":"link in","z":"e642c9a2598507ed","name":"about writing","links":["31f14d4e4f53f3ae"],"x":1846.333267211914,"y":713.666671037674,"wires":[["95577053956e7dec"]]},{"id":"0ec207d7fd717d2f","type":"link in","z":"e642c9a2598507ed","name":"prompt engineering","links":["8db3e7dd6a0f8bea"],"x":1694.000015258789,"y":564.6111347675323,"wires":[["dce98b70accca825","29f51a62934ac44c"]]},{"id":"f51f24a5eb4b9f1a","type":"Thought","z":"e642c9a2598507ed","name":"Google Engineering","info":"Prompt engineering is just a structured form of the programming that we are doing already: google and stack-overflow programming.\n\nEvery developer searches out solutions for their problems, whether one does that in a structured and computerised manner or in a unstructured and more random way, it makes no difference.\n\nAI becomes a giant interactive search engine with the abilities to hallucinate.\n","sumPass":false,"sumPassPrio":0,"sumPassNodeId":"","createdAt":"2023-07-06T05:34:40.410Z","updatedAt":"2023-07-06T05:37:04.137Z","x":2321.000015258789,"y":702.3333580493927,"wires":[[]]},{"id":"b294d4532c346392","type":"Idea","z":"e642c9a2598507ed","name":"Oracle Oriented Programming (OOP)","info":"https://blog.openmindmap.org/blog/oracle-oriented-programming","sumPass":false,"sumPassPrio":0,"sumPassNodeId":"","createdAt":"2023-08-26T07:43:27.012Z","updatedAt":"2023-08-26T07:44:14.448Z","x":2324.000015258789,"y":751.3333580493927,"wires":[[]]},{"id":"869d360d0141e151","type":"Topic","z":"e642c9a2598507ed","name":"Altruism","info":"altruism, noun\n\n> 1: unselfish regard for or devotion to the welfare of others\n>> charitable acts motivated purely by altruism\n\n> 2: behavior by an animal that is not beneficial to or may be harmful to itself but that benefits others of its species\n\nhttps://www.merriam-webster.com/dictionary/altruism","createdAt":"2023-07-03T08:08:48.528Z","updatedAt":"2023-07-03T11:41:28.405Z","x":490,"y":2563,"wires":[["7b1fa04b60b45647","8dbbcaad9756d49e","4d48515b28edaba3","e7d976b3ed6fec3b","5f360e07cb2d053a","146205c23dae4ca3"]]},{"id":"58a1b7d5a39170ff","type":"link in","z":"e642c9a2598507ed","name":"Empathy","links":["2205136176c782e1","6c6b8c7c7d4a7cb9"],"x":659.6663818359375,"y":2123.7783203125,"wires":[["e7d976b3ed6fec3b"]]},{"id":"6c60c63014e8ed46","type":"Aphorism","z":"e642c9a2598507ed","name":"Giving based on taking is a transaction.","info":"\nGiving based on taking isn't empathy.\n\n----\n\nGiving and taking have become measured and weighted, the units of that is money. What was the world like when this was not the case? \n\nWhen we gave and some took and some more gave. The measurement of altruism ruins those who natural like to give more since their giving needs customers. People can't accept since they believe everything is measured. Measured in units of money.\n","createdAt":"2023-07-03T08:08:48.528Z","updatedAt":"2023-07-03T11:41:28.405Z","x":1301.6666259765625,"y":2100.0835762023926,"wires":[[]]},{"id":"e63bfc828bdfda2d","type":"Quote","z":"e642c9a2598507ed","name":"Doing good in the face of bad","info":"In fact is taking the negative energy and combining it all to get a positiveness - two negatives make a positive. This also works for emotional energies.\n\nIt is the empathy that happens when oneself is under enormous stress and burden. It is going against the automatism of feeling bad and lonely in bad times, it is taking the reverse position and doing something positive which makes oneself feel positive. It fact is taking the negative energy and combining it all to get a positiveness - two negatives make a positive. This also works for emotional energies.","createdAt":"2023-07-03T08:08:48.528Z","updatedAt":"2023-07-03T11:41:28.405Z","x":1273.6666259765625,"y":2154.500244140625,"wires":[[]]},{"id":"13aedc65c06bb4c9","type":"Text","z":"e642c9a2598507ed","name":"Shared Pain is halved pain, shared love is doubled.","info":"It was a wet and stormy night that found me sitting at the bar at one of my favourite bars. As I usual do on nights like these and many other nights that aren't as wet and stormy. Believing that to be a good writer, you need to be a good drinker.\n\nI talk to strangers, friends and lovers. Listening to their stories, reflecting on mine and enjoying the meditation that can only come while staring at my drink. Being a writer can be a lonely business and having at least some social contact with real people does me good.\n\nHaving an office job provides a zoo of social interactions. People are everywhere, meetings are constant and thoughts are buried amongst the discussions about coffee and where to eat lunch.\n\nOffice jobs are predestinated to shutting one away from empathy, weakening the strength to listen, really listen and not drift off in thoughts that, for me in that moment, seem more relevant than someones problems with their work. Discussions that seem to go on in ever growing spirals, grinding away the spirit of interacting and being honest with people.\n\nWhen I did have an office job, my only desire in the evenings was to reenter the space of silence that was my apartment. My head was filled with work, the issues that plagued my day and the minor incidents that would drive people to their emotional wit's ends. It was the best of times, it was the worst of times.\n\nIt is the empathy found in sharing pain that drives me to these evenings in bars. Listening to people who are being open and honest about their lives, their challenges and their dreams. Those characteristics that make us all human yet that we believe we suffer through alone.\n\nMy essential needs for ideas and thoughts is what drives me to these evenings of random interactions with beings that have the same problems just in different colours. The green of jealous, the red of anger, the blue of tranquility and the white radiate light of enlightenment when my own problems melt away in the face of dire straits of other peoples helplessness.\n\nAnd it is this bonus of giving empathy and winning the enlightenment that my problems are ...minor... and insignificant that makes me want to listen. Eagerly recognising the failings of my concerns.\n\nYet all these nights are gone now.\n","createdAt":"2023-07-03T08:08:48.528Z","updatedAt":"2023-07-03T11:41:28.405Z","x":1331.6666259765625,"y":2206.9167442321777,"wires":[[]]},{"id":"b946bacd382aba69","type":"link in","z":"e642c9a2598507ed","name":"Social media may prevent users from reaping\\n creative rewards of profound boredom - new\\n research","links":["1ec68739e5a81b36"],"x":206.33306884765625,"y":172.33351135253906,"wires":[["8a955e8590b37f7e"]]},{"id":"0ae093ee14beaff5","type":"Definition","z":"e642c9a2598507ed","name":"Socialopath","info":"Addiction to social media and everything to do with the digital societal world.\n\nThe direct opposite of a sociopath which is earmarked with asocial or antisocial behaviour.\n\nBasically someone who can only exist within the world of social media.","createdAt":"2023-07-03T08:08:48.529Z","updatedAt":"2023-07-03T11:41:28.406Z","x":856.9999389648438,"y":149.00001525878906,"wires":[["cc36ec51a5c0a64e","e13bd8aeb4a90a55","bdbea61ca5dffc3f"]]},{"id":"6c8fd353c859ebb7","type":"link out","z":"e642c9a2598507ed","name":"no sensory input","mode":"link","links":["0f4cbfdc3d964e4f","5bb6c8c718bdf653","5f66e1f1c4256261","633572d7f3d0aa69","6b6dfef8f0d3f842"],"x":1430.3330383300781,"y":306.3335494995117,"wires":[]},{"id":"8263d83576f0e6c5","type":"Observation","z":"e642c9a2598507ed","name":"Touch is ever on","info":"Touch is always there, of all senses its the hardest to turn off.\n\nOf our five senses, touch is the only one that cannot be deactivated. I can shut my eyes, I can hold my nose, I close my mouth and I can plug my ears but I can't stop feeling.\n\nIf I lay on a bench and stop feeling the bench, would I then believe that I was floating in the air?\n\nWithout touch are we truly from from this world? Is touch the sense that holds us back from entering a new dimension of belief?\n\n","sumPass":false,"sumPassPrio":0,"sumPassNodeId":"","createdAt":"2023-10-02T09:51:08.599Z","updatedAt":"2023-10-02T09:53:17.624Z","x":1496.9999389648438,"y":253.00001525878906,"wires":[[]]},{"id":"fdd5e87d133aa164","type":"link in","z":"e642c9a2598507ed","name":"normality","links":["a94149a71c3192fd"],"x":3050,"y":2017.333251953125,"wires":[["57f68379f333eba2"]]},{"id":"eb531a522c0c2794","type":"Inspiration","z":"e642c9a2598507ed","name":"Engineers are ADHD candidates","info":"It was this discussion that brought me to the topic: https://news.ycombinator.com/item?id=36719409 specifically this [comment](https://news.ycombinator.com/item?id=36719713) and the discussion that followed from there.\n\nThe article is rather crappy and self-presentational but what the person describes is the classic symptons of ADHD. It reminded me that I potentially have ADHD or did I develop it because I became a programmer?\n\nApparently its \"disease\" that you are born with, so there is no \"developing\" it along the way. I guess if I did have ADHD (and certianly looking back, I also had a case of [ODD](https://en.wikipedia.org/wiki/Oppositional_defiant_disorder)) then programming was well suited to my condition. I guess I found something that fits well to my nature and my mind.\n\n","sumPass":false,"sumPassPrio":0,"sumPassNodeId":"","createdAt":"2023-07-14T08:25:54.219Z","updatedAt":"2023-07-14T09:59:32.068Z","x":3460,"y":2115.3334324359894,"wires":[["ad4f4f9b3f04cef7","05ba14bddc27db4c"]],"icon":"@gorenje/node-red-mindmap/hn.svg"},{"id":"69b878556b3f571a","type":"Thought","z":"e642c9a2598507ed","name":"Mental Destacking","info":"My thoughts work as a stack or rather my short-term todos when I work are stacked upon each other.\n\nThe Stack I'm thinking of here comes from [IT](https://en.wikipedia.org/wiki/Stack_(abstract_data_type)) world and provides a basis for that world.\n\nI push my ideas and todos onto the stack and then I do the top one, before putting something else there (i.e. doing something else) once that is completed, I go back to the todo I was working on.\n\nMostly this happens because I have ideas while working on something or ideas pop back into my head becausae I'm current task reminded me of something.\n","sumPass":false,"sumPassPrio":"0","createdAt":"2023-07-03T08:08:48.525Z","updatedAt":"2025-02-01T13:45:55.323Z","x":4345.5556640625,"y":2115.3334324359894,"wires":[[]]},{"id":"121d2f95635032c9","type":"Inspiration","z":"e642c9a2598507ed","name":"To converse well - Conversations can help","info":"https://aeon.co/essays/a-good-conversation-relaxes-the-mind-and-opens-the-heart\n\n> A good conversation bridges the distances between people and imbues life with pleasure and a sense of discovery\n\nThere is something there that is true, it also helps to calm the mind and focus on something else other than thoughts and ideas that are constantly occurring in my mind.","sumPass":false,"sumPassPrio":0,"sumPassNodeId":"","createdAt":"2023-07-14T11:20:18.950Z","updatedAt":"2023-07-14T11:22:11.407Z","x":4474.33349609375,"y":2175.22216796875,"wires":[[]],"icon":"@gorenje/node-red-mindmap/aeon.svg"},{"id":"84f8c69a6a727468","type":"Idea","z":"e642c9a2598507ed","name":"Chaosmap","info":"Instead of calling it a mind-map, call it a chaosmap - the mindmap for people with ADHD!\n\nUnfortunatlely chaosmap.org is already taken!\n\nThe mind map that I have created here is ironically a picture of my ADHD, a way for me to draw what is going on in my head.","sumPass":false,"sumPassPrio":0,"sumPassNodeId":"","createdAt":"2023-07-14T08:24:17.291Z","updatedAt":"2023-07-14T11:37:27.285Z","x":4425.111328125,"y":2230.333251953125,"wires":[[]]},{"id":"e5ef92332193956c","type":"Thought","z":"e642c9a2598507ed","name":"Build export tool in Node-RED","info":"Based on a bunch a json files and markdown files, it should therefore be possible to write and export tool for my mindmap to their format.\n\nCould be a fun project to do a one-way export just once.","sumPass":false,"sumPassPrio":0,"sumPassNodeId":"","createdAt":"2023-11-01T09:43:40.038Z","updatedAt":"2023-11-01T09:44:55.551Z","x":3157.000015258789,"y":1211.3333580493927,"wires":[[]]},{"id":"29f51a62934ac44c","type":"Topic","z":"e642c9a2598507ed","name":"Artiticial General Intelligence","info":"AGI when it comes will be the end of humans.\n\n> If AGI does come then humans can basically call it a day. Which government would not put a AGI in charge? And that will cause an avalanche with other countries following sort. After that humans are no longer in charge of their destiny.\n\n> If AGI does not occur, then we should accept AI as a neat tool that makes mistakes. Which means it's basically a bubble (see block chain technology) as with all new technology that comes along and that we initially don't - fully - understand. Eventually we organise society around the new tool and life goes on.\n\nhttps://news.ycombinator.com/item?id=36755033\n\n","sumPass":false,"sumPassPrio":0,"sumPassNodeId":"","createdAt":"2023-07-17T10:37:41.178Z","updatedAt":"2023-07-17T10:38:37.189Z","x":1937.000015258789,"y":564.6111347675323,"wires":[["191d19f63974ca51"]]},{"id":"7b1fa04b60b45647","type":"Text","z":"e642c9a2598507ed","name":"He","info":"# Foreword\n\nThis is work is inspired by [*We*](https://en.wikipedia.org/wiki/We_(novel)) by [Yevgeny Zamyatin](https://en.wikipedia.org/wiki/Yevgeny_Zamyatin). *We* has influenced both Orwells *1984* and Huxleys *A Brave New World*, reading *We* one is reminded of both books. *We* also influenced [Ayn Rand](https://en.wikipedia.org/wiki/Ayn_Rand) and her book [*Anthem*](https://en.wikipedia.org/wiki/Anthem_(novella)).  This book is a persiflage on Ayn Rands works and philosophy. *Wow, it's a fountain pen* is a reference to her book *The Fountainhead* and the subtitle *In praise of altruism* is taken from her work [*The virtue of Selfishness*](https://en.wikipedia.org/wiki/The_Virtue_of_Selfishness).\n\nI personal have issues with Ayn Rands philosophy of [*Objectivism*](https://en.wikipedia.org/wiki/Objectivist_movement) which aims to place the self front and centre of all existence. In her words: \n\n> My philosophy, in essence, is the concept of man as a heroic being, with his own happiness as the moral purpose of his life, with productive achievement as his noblest activity, and reason as his only absolute. \n\nMy addition to that would be: *to the detriment of all others* - see [*The virtue of Selfishness*](https://en.wikipedia.org/wiki/The_Virtue_of_Selfishness). It is this detriment to all others that I dislike. The simple fact is: no person can achieve their own personal happiness *without* influencing their surroundings, their environment, their fellow beings.\n\nThe following sums it up for me:\n\n> No ones personal happiness consists of working for a large corporation delivering products made by other large corporations to people working for yet other large corporations, hoping to find their personal happiness in those products.\n\nAyn Rand died a rational, lonely person who never allowed emotions to get in the way of rationality. Luckily with her [*the world did not end*](https://www.goodreads.com/quotes/309519-i-will-not-die-it-s-the-world-that-will-end), instead it was only her world that ended.\n\nOn the other hand Ayn Rand and I are not that far apart after all, everyone should seek their personal happiness but *not* to the detriment of others, instead in an *altruist* manner of seeking ones own happiness in the happiness of others. This then becomes a dystopian science fiction tale as the thought of *altruistically* helping others is dystopian to those who solely believe in themselves.\n\nI use of the pronoun 'He' throughout this book, the author happens to be male, the book is an incompletely autobiography hence 'I' would be inappropriate. The author does not to wish to offend anyone, as a small recompense, a poem:\n\n> I her he<br>\n> You me we<br>\n> Them they us<br>\n> Aren't we all just<br>\n> Astronauts on Spaceship Earth?\n\nThis being a hat tip to [Richard Buckminster Fuller](https://en.wikipedia.org/wiki/Buckminster_Fuller) who popularised the term *Spaceship Earth*. He did coin the term [*Ephemeralization*](https://en.wikipedia.org/w/index.php?title=Ephemeralization&oldid=1114035411) which can be taken to mean:\n\n> [...] the ability of technological advancement to do \"more and more with less and less until eventually you can do everything with nothing,\" [...]\n\nWhich appears to be coming reality except we humans will not be needed as humans require a lot more than *nothing* to get through life.\n","sumPass":false,"sumPassPrio":"0","createdAt":"2023-07-03T08:08:48.528Z","updatedAt":"2025-02-01T13:57:48.603Z","x":1337,"y":2564,"wires":[["bc673374e25fe63b"]]},{"id":"8dbbcaad9756d49e","type":"link out","z":"e642c9a2598507ed","name":"altruism","mode":"link","links":["2f89a602a9f43ab3","3ab8e6ca6d404956","63cf297ca9ddd784","769a015cc78455e3","7890ecc0b7cd2857","b4d0603b0c217538","ed13d00e89676f2b"],"x":689,"y":2495,"wires":[]},{"id":"4d48515b28edaba3","type":"Blog-Post","z":"e642c9a2598507ed","name":"Altruist v. Egoist","info":"https://millieons.org/v/altruist-v-egoist","createdAt":"2023-07-03T08:08:48.529Z","updatedAt":"2023-07-03T11:41:28.406Z","x":717,"y":2683,"wires":[["cecb68d85fb704a0"]]},{"id":"5f360e07cb2d053a","type":"Quote","z":"e642c9a2598507ed","name":"I am because we are","info":"[Ubuntu philosophy](https://en.wikipedia.org/wiki/Ubuntu_philosophy)\n\nAfrican expression of altruism is Ubuntu.\n\nIn [Xhosa](https://en.wikipedia.org/wiki/Xhosa_language), the latter term is used, but is often meant in a more philosophical sense to mean **\"the belief in a universal bond of sharing that connects all humanity\"**.","createdAt":"2023-07-03T08:08:48.530Z","updatedAt":"2023-07-03T11:41:28.406Z","x":747,"y":2620,"wires":[[]]},{"id":"146205c23dae4ca3","type":"Observation","z":"e642c9a2598507ed","name":"Politeness","info":"Politeness is related to unselfishness which in turn is related to altruism.\n\nBeing polite means doing something that you might not want to do in favour of the other. So you are:\n\n- aware of others around you, and\n- you are willing to put their needs in front of yours\n\nthe less people are polite, the less they become aware of others.\n\nAnd putting your needs behind those of others isn't life-threatening needs, politeness is about small socially accepted niceties. So the need your are pushing into the background won't generally have a detrimental affect on your life in general.","sumPass":false,"sumPassPrio":0,"sumPassNodeId":"","createdAt":"2023-07-14T10:59:18.024Z","updatedAt":"2023-07-14T11:04:49.758Z","x":762,"y":2384,"wires":[["a94149a71c3192fd"]]},{"id":"cc36ec51a5c0a64e","type":"Observation","z":"e642c9a2598507ed","name":"The Personal has been Instagramnised","info":"Personal interactions are now done mostly via social media - instagramised.\n","sumPass":false,"sumPassPrio":"0","createdAt":"2023-07-03T08:08:48.529Z","updatedAt":"2024-05-03T08:22:16.637Z","x":1182.9999389648438,"y":203.00001525878906,"wires":[[]]},{"id":"e13bd8aeb4a90a55","type":"Aphorism","z":"e642c9a2598507ed","name":"Pacification of moving pictures. ","info":"Pacification of the young by television.","createdAt":"2023-07-03T08:08:48.529Z","updatedAt":"2023-07-03T11:41:28.406Z","x":1159.9999389648438,"y":149.00001525878906,"wires":[[]]},{"id":"2596dd4c93c0a33a","type":"Inspiration","z":"e642c9a2598507ed","name":"Effect of Perceptual Load on Performance Within IDE in People with ADHD Symptoms","info":"Yes people with ADHD have an issue focussing! Whoop, whoop to you!\n\nhttps://news.ycombinator.com/item?id=36721055","sumPass":false,"sumPassPrio":0,"sumPassNodeId":"","createdAt":"2023-07-14T14:00:43.175Z","updatedAt":"2023-07-14T14:01:39.777Z","x":2913,"y":2230.333251953125,"wires":[["eb531a522c0c2794"]],"icon":"@gorenje/node-red-mindmap/hn.svg"},{"id":"05ba14bddc27db4c","type":"Inspiration","z":"e642c9a2598507ed","name":"hacking adhd – strategies for the modern developer","info":"https://www.ledger.com/blog/hacking-adhd-strategies-for-the-modern-developer\n\n\n","sumPass":false,"sumPassPrio":0,"sumPassNodeId":"","createdAt":"2023-11-16T08:20:41.982Z","updatedAt":"2023-11-20T08:54:52.721Z","x":3938,"y":2175.22216796875,"wires":[[]]},{"id":"adf6ce0ddc71b7bd","type":"Observation","z":"e642c9a2598507ed","name":"Analogy language is a programming language","info":"What do we learn from the analogy that language is the original programming language of humans?\n\nWhich parallels can we make between the process of programming a computer *correctly* and societal changes using language and specifically the written word?\n\nAre there tools use as linting or test frameworks or frameworkts at all?\n\nIs a framework as a genre? A grouping together of ideas and learnings into a sub-world that fulfils a specific purpose?\n\nAre the beta-testers the first readers of a book that provide feedback? Are grammatical checkers and spell checkers the linters of the literal world?\n\nBut what other parallels can be drawn? Are the notions of \"Release early, release often\", don't repeat yourself or keep it self stupid?\n\n","createdAt":"2023-07-03T08:08:48.530Z","updatedAt":"2023-07-03T11:41:28.406Z","x":2685.9998931884766,"y":711.3333580493927,"wires":[[]]},{"id":"bdbea61ca5dffc3f","type":"Aphorism","z":"e642c9a2598507ed","name":"Question societal norms and assumptions.","info":"Societal norms are the beliefs, customs and traditions that we grow up with and that we take for granted.\n\nThe tradition that sorrow comes with death is one of those norms in western societies. The expectation of success in ones work life is another. Underlying Christian beliefs such as no sexual intercourse outside of the married unit. The belief that being good will bring one to heaven. \n\nThese norms are more or less deeply ingrained in our characters and mental assumptions on how society has to work. Questioning these norms or even being clear that they exist can be helpful.\n\n","createdAt":"2023-07-03T08:08:48.528Z","updatedAt":"2023-07-03T11:41:28.405Z","x":1161.666748046875,"y":102.66668701171875,"wires":[[]]},{"id":"191d19f63974ca51","type":"Quote","z":"e642c9a2598507ed","name":"AGI would get bored with us","info":"Apparently this is is observation that Joseph Weizenbaum made that any form of artificial intelligence would get bored and frustrated by interacting with us.\n\nHe compares it to us talking to dolphins (which might be a little unfair - for the dolphins) - point being there would be such an intelligence gap that any form of communication would be baised towards the higher intelligence.\n\n","sumPass":false,"sumPassPrio":0,"sumPassNodeId":"","createdAt":"2023-08-26T07:44:50.343Z","updatedAt":"2025-02-01T13:58:53.951Z","x":2440.6667861938477,"y":564.6111347675323,"wires":[[]]},{"id":"12e4fffde871807e","type":"link in","z":"e642c9a2598507ed","name":"He - Book/Idea","links":["33838720ad4ad23f","6c6b8c7c7d4a7cb9","b449f2f7e4729ad3","ca76cf15cdd09a95"],"x":1203,"y":2612,"wires":[["7b1fa04b60b45647"]]},{"id":"8dded47767748d86","type":"Thought","z":"e642c9a2598507ed","name":"Of Authors and Philosophers","info":"Authors here meaning Sci-Fi authors who glorified attempts to predict the future have varied from the strange to the dystopian. Each analyses the present to build their own representation of the future. Those that which sell their books paint a dystopian, destructive future of hate, fear and death. Ironically then with a happy end.\n\nPhilosophers analyses the present and the past and make suggestions for improving the future. They too build their own future but always with the intention of improving the world and not searching for a dystopian future where humans are enslaved by their own technology.\n\nSo what would happen if a Sci-Fi author were to describe a future that happens to be an improvement and a place of happiness, while the philosophers describes the instruments needed for that dystopian future that everyone believes in.","sumPass":false,"sumPassPrio":"0","createdAt":"2023-07-03T08:08:48.528Z","updatedAt":"2025-02-01T13:57:57.774Z","x":1108.0000457763672,"y":2478.9999046325684,"wires":[["7b1fa04b60b45647"]]},{"id":"bc673374e25fe63b","type":"Text","z":"e642c9a2598507ed","name":"Untrodden paths","info":"Always take the least trodden path or make your own fresh path through life. This helps you to avoid all the others that have taken the common path. If you take the well trodden path, you will come out there were either everyone is or has been.\n\nThis can be a lonely journey through life, one that requires trust and belief in oneself. To be assured that one is making the right choices, there are no signposts or waypoints to know you are on the right path. There are no fellow travellers on your path.\n\nTrust in yourself is the only guide on a journey through the virginal landscape of your life. Believing and knowing that you are making the right choices along the path is the guiding star in the night sky.\n\nOccasionally one stumbles upon fellow travellers, either they have been there were before one arrives or they have been waiting for you to arrive. It is up to oneself to hold those travellers in esteem as guides providing assurance or as a monument to failure, one has come to somewhere, be it an idea or a thought, that someone else has previously thought. Ones path has brought one to the point where someone else was but coming via a different route.\n\nIt was the latter aspect that had escaped me for a long time. I have travelled along the untrodden, unspoiled paths of life, coming to regions unbeknownst to the many. Many a time I would come across a piece wisdom that would confirm something I had thought or created. That someone else could have thought the same that I had would always cause a sense of failure in me as it made me feel as if I had been walking in circles. I always wished to travel the untouched landscapes, to be the explorer that finds the lost continent.\n\nA recent piece of wisdom that made me see the light was Carl Jung when he wrote:\n\n> Until you make the unconscious conscious, it will rule your life and you will call it Fate.\n\n==I have come to the point of [...]==\n\nInitial it made me feel as if my ideas on letting the unconscious guide me were not novel or innovative, they were a *rediscovery* of Jung. This made me a little sad.\n\nThen I realised that no, this was a good sign. It showed that, in my own way, I got to where Jung already was. This means that I understand what Jung had to say and it's taken my path and experiences to understand him. No teacher, no lecturer could have done the same as me finding and honouring Jung on my own.\n\nAnd that when I realised that *rediscovery* is sometimes *invention* for oneself:\n\nOn a planet where America has already been discovered, no one else will the discovery of America. In a world where everything has been invented, discovery is sometimes just as good as invention - for oneself.\n\nFurther examples:\n\n- Brecht with his creativity under pressure of from the Nazis - this is a clear copy of what wrote about my mother and her ability to be positive under massive amounts of stress.\n- Nietzsche and his acclaim of Buddhism as an alternative to the christian church, which concise with my finding Buddhism through meditation \n- Adam Curtis and his [interview](https://www.youtube.com/watch?v=lp2vGAD-BGw) where he says at the end that societies narrow their range of thoughts down so as not to jump out of the mainstream river, and this is compares to my criticism of the christian church that implants thoughts and ideas into our heads that prevent us from thinking of better alternatives.\n- Huxley and his doors of perception which I read and never understood and then suddenly came clarity which is also a point for that sometimes wisdom only comes with experience and that certain pieces of knowledge only make sense if you have the right experiences. \n","sumPass":false,"sumPassPrio":"0","createdAt":"2023-07-03T08:08:48.528Z","updatedAt":"2024-09-30T15:04:37.528Z","x":1548,"y":2738,"wires":[["3dbc3f97c4a9e2a0","b6352965a51f6b13"]]},{"id":"cecb68d85fb704a0","type":"Observation","z":"e642c9a2598507ed","name":"","info":"Just another unpleasant piece of evidence that the world does not revolve around you","createdAt":"2023-07-03T08:08:48.529Z","updatedAt":"2023-07-03T11:41:28.406Z","x":1114,"y":2683,"wires":[[]]},{"id":"a94149a71c3192fd","type":"link out","z":"e642c9a2598507ed","name":"politeness","mode":"link","links":["fdd5e87d133aa164"],"x":943,"y":2335,"wires":[]},{"id":"faed86899fb1e8de","type":"link in","z":"e642c9a2598507ed","name":"The Personal has been Instagramised","links":["b449f2f7e4729ad3"],"x":937.9999389648438,"y":203.00001525878906,"wires":[["cc36ec51a5c0a64e"]]},{"id":"52a0a89e9140c00e","type":"Contact","z":"e642c9a2598507ed","name":"Joseph Weizenbaum","base64image":"","base64Type":"","rawJsonData":"[\"vcard\",[[\"version\",{},\"text\",\"3.0\"],[\"prodid\",{},\"text\",\"-//Node-RED//vCard Node//EN\"],[\"fn\",{},\"text\",\"Joseph Weizenbaum\"],[\"url\",{\"type\":[\"internet\",\"home\"]},\"text\",\"https://en.wikipedia.org/wiki/Joseph_Weizenbaum\"],[\"url\",{\"type\":[\"internet\",\"home\"]},\"text\",\"https://en.wikipedia.org/wiki/ELIZA\"],[\"note\",{},\"text\",\"Inventor of ELIZA\"]]]","createdAt":"2024-10-09T10:04:32.109Z","updatedAt":"2024-10-09T10:05:18.365Z","x":2208.000015258789,"y":616.3333580493927,"wires":[["191d19f63974ca51","499420bea2055558"]]},{"id":"b478286feabe8141","type":"Quote","z":"e642c9a2598507ed","name":"","info":"Make the unconscious conscious, else you will be guided by it and call it fate.","sumPass":false,"sumPassPrio":"0","createdAt":"2023-07-03T08:08:48.528Z","updatedAt":"2024-11-07T19:00:22.279Z","x":686,"y":2975,"wires":[["bc673374e25fe63b","a8aa0440d075da85","b6352965a51f6b13","e9135df6426f0f32"]]},{"id":"32422820aaae1d5a","type":"link in","z":"e642c9a2598507ed","name":"untrodden paths","links":["063d78dae290d8af","bd18f06985845332","88054a216c97a611"],"x":1333,"y":2919,"wires":[["bc673374e25fe63b"]]},{"id":"f407e07516b2058e","type":"Observation","z":"e642c9a2598507ed","name":"Reassurance","info":"It made me happy because I now know I am on the right path (for me). And I am not alone on that path.\n\nGoing ones own way can be nerve-racking sometimes because isn't sure if one is on the right path. \n\nSometimes one comes up with great ideas believing that one is the first to have discovered that idea. Later it turns out that someone else has been there before you. \n\nYou might get frustrated that your brilliant idea has been had before.\n\nAlternatively you can take this as a signpost for knowing you are on the right path. A path that has been trodden but its the path you chose. So that you know you are in good company even if the other has moved on to somewhere else.\n\nThe latter has become my approach to having ideas. I don't mind them being a rediscovery and not an invention. In a world overfilled with inventions and ideas, it's ok to rediscover things.","createdAt":"2023-07-03T08:08:48.529Z","updatedAt":"2023-07-03T11:41:28.406Z","x":1303,"y":3099,"wires":[["bc673374e25fe63b"]]},{"id":"bcca04cda7ecbcc6","type":"Contact","z":"e642c9a2598507ed","name":"Carl Jung","base64image":"","base64Type":"","rawJsonData":"[\"vcard\",[[\"version\",{},\"text\",\"3.0\"],[\"prodid\",{},\"text\",\"-//Node-RED//vCard Node//EN\"],[\"fn\",{},\"text\",\"Carl Jung\"],[\"url\",{\"type\":[\"internet\",\"home\"]},\"text\",\"https://en.wikipedia.org/wiki/Carl_Jung\"]]]","createdAt":"2024-10-09T10:27:18.171Z","updatedAt":"2024-10-09T10:27:31.869Z","x":324,"y":2747,"wires":[["b478286feabe8141","bc673374e25fe63b","a8aa0440d075da85","c0644c9317044b6a"]]},{"id":"3dbc3f97c4a9e2a0","type":"Aphorism","z":"e642c9a2598507ed","name":"Failure lies in listening to others and not yourself","info":"Failure lies in listening to others and not listening to yourself. Others push their fears onto you as parents push their fears onto their children.\n\nGuidance comes from the wise that recognise your ambitions and dreams as a shared goal. Finding those that guide and not judge is the needle in the haystack.\n\nGuide those that have not yet found their guide and respect those who judge for whom they are, scared and goalless.\n\nThese might be the christian values but does not that make me a christian instead I am a human.\n","sumPass":false,"sumPassPrio":"0","createdAt":"2023-07-03T08:08:48.528Z","updatedAt":"2025-02-01T13:53:10.731Z","x":1929.4444427490234,"y":2738,"wires":[[]]},{"id":"b6352965a51f6b13","type":"Text","z":"e642c9a2598507ed","name":"Influencing the Unconscious","info":"*Working with the unconscious is similar to having a baby: it arrives when it wants, it screams, eats, shits on its own timetable and we love it for being our shared future generation.* -- Me.\n\nThis would be the rational, scientific, accepted interpretation of the unconscious which is also reflected in the nominal notion of unconscious as being the *subconscious*: a *sub* or degraded form of the consciousness.\n\nFor society complexity blocks simplicity, that which is not complex cannot work, so simple approaches for a better humanity are ignored or dismissed. \n\n1) Pick up a glass of water and drink from it. Now reflect on how that happened. First your conscious formulated the desire for water. Then the conscious decided to drink from that glass. How did the water get into your mouth and stomach? How did your body prevent the water from going into your lungs? How did the glass end up on the counter from which you original picked up from? All these actions were coordinated, carried-out and controlled by your unconscious. You could even continue listening to whoever it was that was talking to you as you drank from the glass. It was the unconscious that controlled all the muscles and nerves that made it happen and that is an incredible performance for something that is occasionally, degraded to being \"sub\"-par to our conscious.\n\n2) Typing on a keyboard is not a matter of coordinating muscles to tap keys on a keyboard, it is a matter of formulating sentences and ideas so that our unconscious can interact with the keyboard to create those sentences.\n\n3) Reflex, gut feelings, emotions, instinct, muscle memory are all based in the unconscious. These are those unexplained actions that we sometimes revert to when we just react without reflection. *Consciously* catching a ball in flight would require immeasurable amount of calculus to compute the flight path to know when and where our hands should go to catch the ball. Alternatively we let our unconscious do all the work and we *instinctively* catch the ball.\n\nOf course there are numerous other examples of how the unconscious assists us through our lives. Just imagine getting out of bed in the mornings if each muscle would need to be actively coordinated. When was the last time you actively beat your heart or reminded yourself to take a breath of air?\n\nThat is why we talk of muscle memory: those activities that one never forgets how to perform. Everything from bicycle riding to typing on a keyboard, to peeling a potato. Unfortunately it has nothing to with the muscle memory (or do muscles have memory cells?), it is the unconscious which has learnt to perform these tasks.\n\nOnce we realise how powerful the unconscious really is, how can we use it? Anyone who has forgotten a name only to remember it some time later when the name just pops into ones head knows that the unconscious can be used somewhat as an instrument of query.\n\nFor anyone who has played competitive sport, being relaxed, being focussed and in the zone are all possibilities to allow the unconscious to help them reach their best performance. The point of practice is not to develop the \"muscle memory\" but to train the unconscious to perform the task at the highest level of accuracy.\n\nWhy do we have our best ideas under the shower in the morning? We enter a kind of comfortable automatic mode whereby the conscious is tuned out and the subconscious is guiding the show. Having time to allow that to happen is very important if you want to make the most of what your mind has to offer. Give your unconscious the time to reflect and then listen to its suggestions. Just as you \"command\" the unconscious to drink from a glass of water, so too can you ask the unconscious to provide that name that you have forgotten.\n\nJust as that name pops in your head, so too do possible solutions to those issues that having constantly going through your head. If you do not listen to those suggestions, then you are only using twenty percent of your possibilities. As the unconscious is very shy, you need to provide it with space to speak with you. Conscious is a stage hogger and loves the limelight, getting conscious to be backstage can help to have the unconscious come into the limelight.\n\nBut moving on, I hope I was able to point out the importance of the unconscious and its comparability with the conscious, if not its exaltation of the latter. I come now to the point of this article: how to influence the unconscious? Not how to dominate the unconscious, instead how to provide guidance. To guide the unconscious in spontaneous situations were we react, so that we react in a ways that sit comfortably with our conscious beliefs.\n\nWhen spontaneously catching falling objects off a kitchen bench, we catch the glass but avoid the knife. This is the guidance that our unconscious has learned. How can we guide our unconscious to react with love and not hate? The falling knife is left to fall out of a love to ourselves rather than a fear of injury. But this is a love for ourselves and not a love of others, how to teach the unconscious to react in love to others and not just in love to ourselves?\n\nHow then can the unconscious be influenced? Humans have two very powerful emotions happiness and fear. Fear is the basis for hate, jealousy, being scared, and assorted other negative emotions. Happiness, oneness with provides the basis for love, sharing, caring and the positive emotions that make life worthwhile. Both can influence the unconscious, of course, in opposite directions.\n\nOf the two, fear is the more motivational. Humans go to war on the basis of fear, fear of those we think are threatening us. A fear of missing out makes us use applications that make us feel miserable about ourselves. Advertising uses fear to make you think that you are not good enough unless you purchase a specific product.\n\nHappiness allows us to come together and enjoy life together. Happiness allows us to live together without fearing something will happen.\n\nInfluencing the unconscious becomes a question of reaching the unconscious.\n","sumPass":false,"sumPassPrio":"0","createdAt":"2023-07-03T08:08:48.528Z","updatedAt":"2025-02-01T13:52:14.969Z","x":2412,"y":2985,"wires":[["1703f04c4bddede6","3a60f912a004cc56","cb4a25ae4be845bd"]]},{"id":"499420bea2055558","type":"Quote","z":"e642c9a2598507ed","name":"Computers are a conservative force","info":"> He started to think philosophically about the implications of artificial intelligence and later became one of its leading critics.[7] In an interview with MIT's The Tech, Weizenbaum elaborated on his fears, expanding them beyond the realm of mere artificial intelligence, explaining that his fears for society and the future of society were largely because of the computer itself. His belief was that the computer, at its most base level, is a fundamentally conservative force and that despite being a technological innovation, it would end up hindering social progress. Weizenbaum used his experience working with Bank of America as justification for his reasoning, saying that the computer allowed banks to deal with an ever-expanding number of checks in play that otherwise would have forced drastic changes to banking organization such as decentralization. As such, although the computer allowed the industry to become more efficient, it prevented a fundamental re-haul of the system.[8]\n\n> Weizenbaum also worried about the negative effects computers would have with regards to the military, calling the computer \"a child of the military.\" \n\n\n-- [wikipedia](https://en.wikipedia.org/w/index.php?title=Joseph_Weizenbaum&oldid=1247972686)\n","sumPass":false,"sumPassPrio":0,"sumPassNodeId":"","createdAt":"2024-10-09T10:10:37.669Z","updatedAt":"2024-10-09T10:14:13.124Z","x":2532.000015258789,"y":616.3333580493927,"wires":[["d33a87928828e6a3"]]},{"id":"05d41de1b25f7f83","type":"Thought","z":"e642c9a2598507ed","name":"Reinventing the wheel","info":"As children we all discover the wheel and the first time we encounter a wheel, we are fascinated.\n\nOnly later are we are told that it's a wheel and it has already been invented.\n\nSo it is with ideas and thoughts, sure a lot people have had the same ideas and thoughts but that doesn't mean that rediscovery is bad.\n\n===\n\nAs children we discover the wheel before we are told it's a wheel. Sometimes we discover fire before we are told it burns.\n\nOur personal world is full of rediscovery. Recently I discovered Carl Jung because he said:\n\n> Make the unconscious conscious, else you will be guided by it and call it fate.\n\nI came to the same conclusion but before I read that. I discovered something that Jung also did.\n\nIt made me happy because I now know I am on the right path (for me). And I am not alone on that path.\n\n","sumPass":false,"sumPassPrio":"0","createdAt":"2023-07-03T08:08:48.529Z","updatedAt":"2025-02-01T13:54:58.259Z","x":199,"y":2974,"wires":[["b478286feabe8141","901bb224cf9e569a"]]},{"id":"a8aa0440d075da85","type":"Text","z":"e642c9a2598507ed","name":"consciousness is a memory","info":"An article on the [conscious](https://singularityhub.com/2022/10/25/could-consciousness-be-a-memory-system-new-theory-says-yes/):\n\n> It gets more mind-bending. Rather than perceiving the world in real time, we’re actually experiencing a memory of that perception. That is, our unconscious minds filter and process the world under the hood, and often make split-second decisions. When we become aware of those perceptions and decisions—that is, once they’ve risen to the level of consciousness—we’re actually experiencing “memories of those unconscious decisions and actions,” the authors explained.\n\nHow does conscious awareness develop?\n\nThe original article, if true, would imply that memory came before conscious experience. I would assume that unconscious instincts/reflexes/emotions where the original experience of all species. Is it instinct that does not work without a memory? Instinct to know that a lion will eat us if we get close?\n\nI would assume that consciousness did not develop in parallel to unconsciousness. This I consider can be seen in the development of a baby to an adult, we can't recall our earliest moments of birth (regardless of how go our memories our). This for me demonstrates that our conscious is not mature at birth, it is honed over the first few months of childhood.\n\nConscious developing out of the memories that we collect makes complete sense if we consider that a babys' conscious develops as it grows. This then would be because new born babies don't have any memories. As the unconscious fills the memory banks of the mind, our conscious becomes ever more present.\n\nWhere did conscious come from?\n\nDreams could hold the key to the development of the conscious. Other species dream, one can observe a dog twitching its legs and eyes as it sleeps. Psychologist claim that one reason we dream is that we are storing away the events of the day. Thus in our dreams we fill the memory banks of the mind.\n\nI would argue that the spark for our conscious came through our dreaming. The visual effects that we call dreams is the feedback into our visual cortex as our minds store away events of the day. This is how our instinct is honed over the years. Each snake, lion or spider becomes a further entry in our library of animals that might cause us harm.\n\nThe waking process of having those dream images in ones head could have been the point at which we questioned the world. Slowly awaking with imagery that did not reflect what had happened or which reflected an enemy yet faced, might well have triggered a change in the mind to allow the experiencer to reflect on those imagery. And with this reflection came consciousness.\n\nIf one goes a step further and reflects on psychedelic drugs, which a tribe of hunter and gathers would have gotten in contact with, that experience would have triggered imagery that would have triggered questioning, finally with that questioning came the consciousness.\n\nHow to use the Unconscious?\n\n[Carl Jung](https://www.goodreads.com/quotes/44379-until-you-make-the-unconscious-conscious-it-will-direct-your) summed it up:\n\n> Until you make the unconscious conscious, it will direct your life and you will call it fate.\n\nThe subtlety in what Jung says is that we can consciously use the unconscious to live our lives or be unconsciously guided by fate, which is happening today. Transforming the unconscious from being passive to being active.\n\n[...]\n\nHow to plan?\n\nFor me the conclusion is that planning lies in desire: I desire something, allow my unconscious to guide me and I will get what I desire. I give the unconscious a command and it will ensure that command is fulfilled. This does not only include immediate things such as drinking a coffee or moving an object. It means long term goals and long term plans. Fulfilling plans becomes a case of giving the unconscious as many opportunities and possibilities to guide us, to guide us to the our long term goal or to fulfil our plans.\n\nThis requires trust and faith in the unconscious. The faith of knowing the unconscious wishes to help us and the trust that the unconscious recognises and knows the path to our goal. And this is a big ask for a society that is conscious-based society, one driven by \"conscious decision making\". In not regarding the unconscious as part of us, we end up making stories to fill in the gaps of our misunderstanding of why we make certain decisions instead of accepting them and trusting that they lead us in the right direction.\n\nWhat about Oneness?\n\n[...]\n\nNeed to realise that true oneness is reached when the distinction between conscious and unconscious has been dissolved. this does not mean death, this means in thinking. the emphasis on unconscious and conscious can bring one to a certain point but beyond that point, one has to embrace oneness. embracing oneness means oneness in mind without question.\n\nIn the realisation that true oneness is found by dissolving the divide between conscious and unconscious, comes the perplexing conflict of letting go of something I had recently discovered. I had to let go of my understand of the depth and vastness and guidance of the unconscious for me to spiritually move on. Again I saw the delegate wisdom of the Buddha, journey and letting go. Letting go of my mother, letting go of my unconscious guidance, lets me go and move on spiritually, to reach a oneness with true peace and harmony.\n\nIt becomes uncomfortable when one begins to think about what comes after Oneness? The answer lies within the universe. Oneness carries in it the seeds of the Big Bang, a spiritual new start which will lead to the Oneness of spirit, the eternal circle of spirituality. Rediscovery is invention in a world that has forgotten all.\n\nWe experience oneness when the sperm joins the egg, we grow in the oneness of our mother, we are born and experience duality with our mother. Our lives is the searching for the oneness\nDuality becomes the temptation to search for something else, but it is misguided.\nIn the duality with our partner we seek the oneness of birth, of giving life.\n","sumPass":false,"sumPassPrio":"0","createdAt":"2023-07-03T08:08:48.528Z","updatedAt":"2024-10-09T10:27:44.774Z","x":1116,"y":2770,"wires":[["62a3504a8c653e81"]]},{"id":"e9135df6426f0f32","type":"link out","z":"e642c9a2598507ed","name":"make unconscious conscious","mode":"link","links":["b906ed90a47aeb11","7e2af932b681de30"],"x":1085,"y":3057,"wires":[]},{"id":"901bb224cf9e569a","type":"Idea","z":"e642c9a2598507ed","name":"Rediscovery is Reassurance","info":"I have done this many times, I have this brilliant idea, all by myself and then I present this idea to friends. Mostly they say that the idea has already been thought, done, invented.\n\nI used to be frustrated about such moments and thing that I was dumb for having the same idea as someone else but then I realised that it is reassuring to have such a moment.\n\nIt shows that I have come to the same place that people before me have however I have gotten there on my own way, not by following their foot steps.\n\nSo I am reassured that I am on the right way on my own path. And that is comfortinhg to know that I have come to a milestone on my journey.\n\nWhen I was younger I was determined to do everything in my way and push the envelope of knowledge and ideas. I was always frustrated when I came across thought ideas or previously discovered wisdom. I was young and naive. \n\nNow I know better and I am glad I do.\n\n","sumPass":false,"sumPassPrio":"0","createdAt":"2023-07-03T08:08:48.528Z","updatedAt":"2025-02-01T13:55:52.860Z","x":828,"y":3099,"wires":[["f407e07516b2058e","bc673374e25fe63b"]]},{"id":"c0644c9317044b6a","type":"link out","z":"e642c9a2598507ed","name":"carl jung","mode":"link","links":["d6c26c45841ba05e"],"x":555,"y":2802,"wires":[]},{"id":"aeacfd0af8c05f39","type":"Quote","z":"e642c9a2598507ed","name":"nominal notion of unconscious as being the\\n subconscious: a sub or degraded form of\\n the consciousness.","info":"","sumPass":false,"sumPassPrio":"0","createdAt":"2023-07-03T08:08:48.528Z","updatedAt":"2025-02-01T13:49:11.317Z","x":1617,"y":3068,"wires":[["b6352965a51f6b13","eeaaf7f9f9e448a3"]]},{"id":"6b6dfef8f0d3f842","type":"link in","z":"e642c9a2598507ed","name":"influencing the unconscious","links":["6c8fd353c859ebb7","fba907c696d2df66"],"x":1799,"y":2904,"wires":[["b6352965a51f6b13"]]},{"id":"1703f04c4bddede6","type":"Thought","z":"e642c9a2598507ed","name":"Our Unconscious is our Free Will","info":"There has been a studies concerning that the brain makes decisions before we conscious consider these decisions.\n\n- https://www.nature.com/articles/news.2008.751\n- https://www.psychologytoday.com/us/blog/unconscious-branding/202012/our-brains-make-our-minds-we-know-it\n- https://www.nationalgeographic.com/science/article/unconscious-brain-activity-shapes-our-decisions\n\nThis seems to indicate that our free will is not located in the conscious part of our brain but our unconscious (previously known as subconscious).\n\nWe have lost our connection to our free will by becoming far too conscious. Our society has daemonizeed religion, spirituality and all forms of belief, leaving us to believe that we are truly in charge of our own destinies.\n\nBelief in Gods, myths and tradition has taken our knowledge, our freedoms to follow our beliefs and the ability for the unconscious to guide us through our lives. \n\nThe tenor of this text is that unconscious is the centre of the unexplainable - spirituality, religion, god - and therefore also our centre of the unexpected, the unplanned and the emotional. If the *indirect* beliefs are taken from us (spirituality, religion, god) then our access to the unconscious is capped. Losing the emotional and unplanned spontaneity that makes the spice of life.\n\n---\n\nFree will exists but it exists in our unconscious. We have forgotten to give it our goals and have it guide us as we have lost our spirituality which is the way humans connect to their unconscious","sumPass":false,"sumPassPrio":"0","createdAt":"2023-07-03T08:08:48.530Z","updatedAt":"2024-05-03T07:57:32.283Z","x":3032,"y":2946,"wires":[[]]},{"id":"3a60f912a004cc56","type":"Thought","z":"e642c9a2598507ed","name":"Body language - Unconscious and how we use it","info":"Body language is another good example of how the unconscious is guiding us. \n\nAlso seeing things out the corner of one’s eye - the unconscious sees things but only gets us to turn our heads if there is something the unconscious cannot identify. \n\nAvoid holding memories directly in the conscious, let memories be triggered as needed - they will come back once you let go. Consciously collect memories.\n","sumPass":false,"sumPassPrio":0,"sumPassNodeId":"","createdAt":"2024-06-02T11:47:11.442Z","updatedAt":"2024-06-02T11:48:30.063Z","x":2847,"y":3063,"wires":[[]]},{"id":"cb4a25ae4be845bd","type":"Thought","z":"e642c9a2598507ed","name":"Living by the Fibonacci numbers","info":"The idea came while having a discussion with Tim (no details known) who works for a company that models plants using models.\n\nHe told me that they have 9 (or so) simple models with which they can represent all plants.\n\nThe point being that nature uses very simple algorithms to create life.\n\nNature has optimised for the environment it exist in. That implies that these algorithms are optimised over eons.\n\nIt turns out that leafs on the trunk of a plant are distributed by the fibonacci sequence. Why is this? Because the distribution maximises the amount of sun each leaf gets when the plant does not know what the future will bring.\n\nFibonacci sequence is not perfect once the plant is larger but its the best approach when the plant does not know what the future brings --> [Phyllotaxis](https://en.wikipedia.org/wiki/Phyllotaxis)\n\nThis made me think about living my life by the Fibonacci sequence somehow. The problem is how to do this. \n\nThe idea would be to handle the unknown future. If plants use fibonacci, then it might also be applicable to us humans.\n\nInteresting idea for influencing the unconsciousness.\n\nhttps://en.wikipedia.org/wiki/Fibonacci_sequence","sumPass":false,"sumPassPrio":0,"sumPassNodeId":"","createdAt":"2024-08-21T13:41:52.004Z","updatedAt":"2024-08-21T14:13:12.622Z","x":2792,"y":2891,"wires":[[]]},{"id":"d33a87928828e6a3","type":"Text","z":"e642c9a2598507ed","name":"Computers hinder social progress","info":"Computers hinder social progress by making inheritly outdated processes more efficient thus making their replacement unnecessary.\n\nA completely different notion but one that has proven itself to be true. To the point of humans creating many workarounds to continue to support these outdated processes.\n\nAnother example would be voting in a democracy that continues to be done in an inefficient and wasteful manner - wasteful because it requires much paper for voting slips and inefficient since organising a vote takes much effort.\n\nA more efficient method would be creating a system of voting that is purely digital and can be easily repeated as often as necessary. Thus allowing direct democracy to be implemented.\n\n","sumPass":false,"sumPassPrio":0,"sumPassNodeId":"","createdAt":"2024-10-09T10:13:16.807Z","updatedAt":"2024-10-09T10:18:33.689Z","x":2869.000015258789,"y":616.3333580493927,"wires":[[]]},{"id":"bb775fd7f544fd05","type":"link in","z":"e642c9a2598507ed","name":"reinventing the wheel","links":["a85e4523fb0c7ecd","88054a216c97a611"],"x":20,"y":2974,"wires":[["05d41de1b25f7f83"]]},{"id":"0cda1654b98b75ad","type":"Inspiration","z":"e642c9a2598507ed","name":"Our Conscious Experience of the World\\n Is But a Memory, Says New Theory","info":"https://singularityhub.com/2022/10/25/could-consciousness-be-a-memory-system-new-theory-says-yes/\n\n> It gets more mind-bending. Rather than perceiving the world in real time, we’re actually experiencing a memory of that perception. That is, our unconscious minds filter and process the world under the hood, and often make split-second decisions. When we become aware of those perceptions and decisions—that is, once they’ve risen to the level of consciousness—we’re actually experiencing “memories of those unconscious decisions and actions,” the authors explained.","sumPass":false,"sumPassPrio":"0","createdAt":"2023-07-03T08:08:48.528Z","updatedAt":"2025-02-01T13:54:37.989Z","x":656,"y":2864,"wires":[["a8aa0440d075da85"]]},{"id":"62a3504a8c653e81","type":"link out","z":"e642c9a2598507ed","name":"conscious is a memory","mode":"link","links":["7de5da78c030a2f9","cad60d13908ab839","d081b6f9f39f278d","a5c57c714703e1f1","7e2af932b681de30"],"x":1030,"y":2852,"wires":[]},{"id":"eeaaf7f9f9e448a3","type":"link out","z":"e642c9a2598507ed","name":"subconscious is a degradation of the unconscious","mode":"link","links":["5bb6c8c718bdf653","633572d7f3d0aa69","d081b6f9f39f278d"],"x":1902.5,"y":3087,"wires":[]},{"id":"29d7e4f68dd78132","type":"link in","z":"e642c9a2598507ed","name":"our unconscious is our free will","links":[],"x":2810,"y":2978,"wires":[["1703f04c4bddede6"]]},{"id":"bd568fada5c4b951","type":"Observation","z":"e642c9a2598507ed","name":"Similar tool: Rodened","info":"https://www.rodened.com/\n\nSeems to have stopped in 2020 but had a python shell node to interact with python in a flow.","sumPass":false,"sumPassPrio":"0","createdAt":"2023-07-03T08:08:48.529Z","updatedAt":"2023-10-02T13:32:27.601Z","x":2824.3330154418945,"y":1019.3333034515381,"wires":[[]]},{"id":"d9191f12ef15b32d","type":"link in","z":"e642c9a2598507ed","name":"chaosmap","links":["8bff2a7724a57c19","b896326e508a2d6b"],"x":4243.7777099609375,"y":2229.333251953125,"wires":[["84f8c69a6a727468"]]}]