[{"id":"ce1285d288bd21ef","type":"tab","label":"Images, Audio and Video","disabled":false,"info":"# Aim\n\nTestbed for multimedia support in mind maps.\n\n","env":[]},{"id":"2f32b15202cc572c","type":"Image","z":"ce1285d288bd21ef","name":"jpeg image","info":"![img](https://cdn.openmindmap.org/content/test-single-frame.jpg)\n\nTesting a single frame jpeg image.","mkdtemp":false,"sumPass":false,"sumPassPrio":0,"sumPassNodeId":"","createdAt":"2024-11-14T18:51:52.297Z","updatedAt":"2025-03-13T20:46:27.479Z","x":183,"y":1036,"wires":[[]]},{"id":"eacc4f66386b8cbd","type":"Image","z":"ce1285d288bd21ef","name":"png image","info":"![img](https://upload.wikimedia.org/wikipedia/commons/e/eb/King%27s_South_Africa_Medal.png)\n\nThis is a remote image and the text to that image. It happens to be related to South Africa.\n","mkdtemp":false,"sumPass":false,"sumPassPrio":0,"sumPassNodeId":"","createdAt":"2024-11-14T18:22:25.593Z","updatedAt":"2025-03-13T20:46:09.512Z","x":388,"y":1149,"wires":[[]]},{"id":"a828fffa77824b2e","type":"Audio","z":"ce1285d288bd21ef","name":"m4a audio","info":"<div class=\"audio-container\">\n<audio controls preload=none>\n<source src=\"https://cdn.openmindmap.org/content/1737284096368_Rethinkingmindmaps.m4a\" type=\"audio/x-m4a\" />\n</audio>\n<p>Download <a href=\"https://cdn.openmindmap.org/content/1737284096368_Rethinkingmindmaps.m4a\" download=\"Rethinkingmindmaps.m4a\">file</a></p>\n</div>\n\nSo, rethinking mind maps in the age of AI. \n\nSo creating a mind map nowadays in the age of AI, AI being a representation of our mind in form of a computer, in form of silicon, that representation is how we believe the mind works like. And mind maps are apparently a map of our minds. \n\nNow, it's the classical mind maps go, they have square boxes that go out with lines going out and out and out, and there's no looping back and there's no typing. So these boxes don't have really much type. And there's no, there's no interaction with a mind map, it's created, and then you look at it and go, well, and all these things are old school mind maps. \n\nSo let's try and recreate those mind maps, let's make them interactive. Since this is a very important thing, since we want a interaction between our minds and ourselves because our minds don't stand still. It's not like that. We can create a snapshot of our minds. But since we've created that snapshot, it's actually antiquated and pointless. So we need to keep on maintaining our mind maps and maintain them in a simple and easy way to do that, to update them as our thoughts gradually grow and then expand. \n\nAnd also our minds are interactive, I interact with my mind, I think, and I interact and I have thoughts and I build concepts and I build ideas. And this is the same way that a mind map should be, it should be interactive and computational. So based on my mind map, I want to create new ideas, new thoughts. So I want to be able to go through my mind and building up new ideas. So it has to be interactive. \n\nAnd a mind map should also provide types. I have an idea, I have a thought, I have an observation, I have a question. These are different types of thoughts I maintain in my mind map. So I need to be able to type mind maps. Mind maps should be working like science. I have certain inputs, from those inputs I create certain thoughts, and from those thoughts, from multiple thoughts, I create conclusions and theories. \n\nOr other way around, I have a conclusion and a theory, and I would recreate the thoughts and the ideas and the experiments to prove that theory. So that's another way a mind map should be able to be used and worked. And this all adds up to a type of mind map where one has a bi-directional linking between nodes, one can alter the types of nodes, one can interact with the types of nodes, one interacts with the nodes of the mind map. One has media, one has a mind contains songs, contains videos, contains images, contains situations. So a mind map must also contain videos and audio and pictures, because that's what our minds also have. \n\nAnd should be able to interlink minds. My mind is interlinked with the minds of my friends. So we share parts of our minds together. So that's the way mind maps should also be interlinkable. And we have also different types, including also people. So you need to have nodes that represent people in your mind map. You have to represent all these concepts that we have in the world within a mind map. And that can be interlinked, all types, everything can be interlinked, even though it might seem silly to be interlinking a video with an observation, but that's the way our mind works. \n\nAnd I have an observation, I have a thought, I have an experiment, and I have a video to that because that's something particularly happened, something, a scenario happened, and that caused me to have that thought. That has to be interlinked.\n\nSo that's the future of mind maps, make intelligent mind maps this way. And if these mind maps grow big enough, then we can probably create intelligence out of that, you can create pathways of thoughts. And so in a certain sense, you move up the chain of intelligence. And instead of predicting words, AI will predict pathways through mind maps. Okay, so you tokenize the prompts, and you create pathways, and then you simulate these pathways within various mind maps, and then you predict the next node that would come up on this mind map. And so then you're actually handling concepts and not words, and nodes and not words. So that will make it an artificial intelligence, far more intelligence than just predicting words without any particular context. \n\nAnd since you're also dividing, you create pathways within mind maps, you can easily say, okay, this is the pathway that actually created this answer or this node. So you can also have, you have context, and you have referential ability, you reference, you take a reference of what pathway you're using. And you have [nachvollziehbarkeit](https://www.dict.cc/?s=Nachvollziehbarkeit) [Ed: traceability, replicability, transparency]. So basically, you can understand what is happening and why it happened.\n","mkdtemp":false,"sumPass":false,"sumPassPrio":0,"sumPassNodeId":"","createdAt":"2025-01-19T10:54:56.835Z","updatedAt":"2025-03-13T20:21:38.006Z","x":186,"y":1250,"wires":[[]]},{"id":"2f931822ca568260","type":"Image","z":"ce1285d288bd21ef","name":"animated gif 1","info":"![img](https://cdn.openmindmap.org/content/1732102026854_text_classification9.gif)\n","mkdtemp":false,"sumPass":false,"sumPassPrio":0,"sumPassNodeId":"","createdAt":"2024-11-20T11:27:07.042Z","updatedAt":"2025-03-13T20:21:52.046Z","x":430,"y":1395,"wires":[[]]},{"id":"94c4c8a2886ad7a2","type":"Video","z":"ce1285d288bd21ef","name":"mp4 no sound","info":"<div class=\"video-container\">\n<video width=\"640\" height=\"360\" controls=\"controls\" preload=\"metadata\" poster=\"https://cdn.openmindmap.org/content/1732102058795_text_classification.mp4.png\">\n<source src=\"https://cdn.openmindmap.org/content/1732102058795_text_classification.mp4\" type=\"video/mp4\">\nYour browser doesn't support HTML5 video.\n</video>\n<p>Download <a href=\"https://cdn.openmindmap.org/content/1732102058795_text_classification.mp4\" download=\"text_classification.mp4\">file</a></p>\n</div>","mkdtemp":false,"sumPass":false,"sumPassPrio":0,"sumPassNodeId":"","createdAt":"2024-11-20T11:27:52.277Z","updatedAt":"2025-03-13T20:22:09.179Z","x":669,"y":1185,"wires":[[]]},{"id":"edc66d0277de12ca","type":"Image","z":"ce1285d288bd21ef","name":"animated gif 2","info":"![img](https://cdn.openmindmap.org/content/1729438029678_fh-retrieve-via-flowhub-nodes.gif)\n","mkdtemp":false,"sumPass":false,"sumPassPrio":0,"sumPassNodeId":"","createdAt":"2024-11-20T11:27:07.042Z","updatedAt":"2025-03-13T20:20:38.826Z","x":195,"y":1393,"wires":[[]]},{"id":"fb29530ea89bee89","type":"Video","z":"ce1285d288bd21ef","name":"mp4 with sound","info":"<div class=\"video-container\">\n<video width=\"640\" height=\"360\" controls=\"controls\" preload=\"metadata\" poster=\"https://cdn.openmindmap.org/content/1712991289079_poster01.png\">\n<source src=\"https://cdn.openmindmap.org/content/1712938909912_FlowHub_-_Episode_01.mp4\" type=\"video/mp4\">\nYour browser doesn't support HTML5 video.\n</video>\n<p>Download <a href=\"https://cdn.openmindmap.org/content/1712938909912_FlowHub_-_Episode_01.mp4\" download=\"text_classification.mp4\">file</a></p>\n</div>","mkdtemp":false,"sumPass":false,"sumPassPrio":0,"sumPassNodeId":"","createdAt":"2024-11-20T11:27:52.277Z","updatedAt":"2025-03-13T20:27:07.963Z","x":805,"y":717,"wires":[[]]},{"id":"4af1f32c47dfe45d","type":"Image","z":"ce1285d288bd21ef","name":"non-animated gif","info":"![img](https://cdn.openmindmap.org/content/test-single-frame.gif)","mkdtemp":false,"sumPass":false,"sumPassPrio":0,"sumPassNodeId":"","createdAt":"2025-03-13T20:31:23.725Z","updatedAt":"2025-03-13T20:41:55.372Z","x":436,"y":1599,"wires":[[]]}]